{
    "issue": {
        "title": "[C++] Investigate automatic generation of YAML for Substrait extension functions & types",
        "body": "***Note**: This issue was originally created as [ARROW-15535](https://issues.apache.org/jira/browse/ARROW-15535). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nArrow supports data types that are not in the Substrait spec (e.g. unsigned integers) and supports functions that are not in the Substrait spec.\r\n\r\nAs a convenience for consumers we can generate a YAML document that describes all the things Arrow supports that are not part of the Substrait spec.  ARROW-15238 has an incomplete example of what this YAML might look like.\r\n\r\nThis YAML can allow for things like better ahead-of-time validation by milddleman validators and optimizers.  It is not strictly required to use these features.\r\n\r\nWe should investigate our ability to generate this automatically.  However, this can get fairly complicated.  For example, we don't want to blindly generate YAML for all functions and types because many of the functions and types map to existing functions and types in the core Substrait spec.",
        "created_at": "2022-02-02T19:50:53.000Z",
        "updated_at": "2022-02-03T18:57:18.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-02-03T12:33:47.459Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15535?focusedCommentId=17486429) by Jeroen van Straten (jvanstraten):*\nAs a followup to this (or maybe a predecessor, not sure which makes more sense?), it may also be useful to expose an API to generate additional YAML for custom compute functions that the user registers at runtime."
        },
        {
            "created_at": "2022-02-03T18:57:18.312Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15535?focusedCommentId=17486662) by Weston Pace (westonpace):*\nAgreed.  We may get that for free or we might not depending on how we tackle this.  We can create an additional JIRA / follow-up as we know more."
        }
    ]
}