{
    "issue": {
        "title": "[Python] Create empty table from schema",
        "body": "***Note**: This issue was originally created as [ARROW-3267](https://issues.apache.org/jira/browse/ARROW-3267). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nWhen one knows the expected schema for its input data but has no input data for a data pipeline, it is necessary to construct an empty table as a sentinel value to pass through.\r\n\r\nThis is a small but often useful convenience function.",
        "created_at": "2018-09-19T09:30:18.000Z",
        "updated_at": "2018-09-20T11:53:43.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2018-09-20T11:53:43.000Z"
    },
    "comments": [
        {
            "created_at": "2018-09-19T17:11:56.861Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-3267?focusedCommentId=16620873) by Paul Rogers (Paul.Rogers):*\nFWIW, ARROW-3164 describes a port of a \"row set mechanism\" from Apache Drill that does exactly this. There are three relevant components:\r\n\r\n1. A fluent schema builder to define the schema.\r\n2. The schema definition itself which includes both scalar and \"complex\" types.\r\n3. A \"row set\" (vector batch) builder to build vectors from schema.\r\n\r\nDrill found that it was helpful to have additional metadata in the schema, such as expected width for VARCHAR columns, expected cardinality for arrays, and expected types for unions.\r\n\r\nThe row set builder could then optionally allocate vector buffers at the approximate desired size, which avoided the need to double vectors repeatedly as they are written.\r\n\r\nThe rest of the mechanism provides a means to write to, or read from vectors, which is beyond the scope of this particular ticket.\r\n\r\nThis ticket talks about Python, so the Java row set code is not directly applicable. Still feel free to borrow ideas. Also, perhaps we can coordinate to establish a common approach across languages."
        },
        {
            "created_at": "2018-09-19T17:18:49.638Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-3267?focusedCommentId=16620908) by Wes McKinney (wesm):*\n[~Paul.Rogers] I think this is a bit different. The scope of this issue is to have a function\r\n\r\n```Java\n\r\ntable = pyarrow.empty_table(schema)\r\n```\r\n\r\nSo the task is to construct the C++ data structure with a bunch of 0-length columns. "
        },
        {
            "created_at": "2018-09-19T17:36:03.297Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-3267?focusedCommentId=16620933) by Paul Rogers (Paul.Rogers):*\nYes, that's were Drill started also, and it is what step 2 in the previous note does.\r\n\r\nI suspect you'll find that, once you have a function, you'll want an easy way to create the schema (step 1).\r\n\r\nThen, unless a mechanism already exists, if you watch allocation logging, you'll see vector doublings you can avoid. So, soon want to optimize allocation performance by providing size hints. The size hint step can be a separate bunch of data, or can be part of the schema passed to the empty_table function. (You might want to have an allocate_table function that creates the table and allocates vectors.)\r\n\r\nSounds like you're not hit these issues yet; but keep this in mind if/when you do.\r\n "
        },
        {
            "created_at": "2018-09-20T08:32:47.297Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-3267?focusedCommentId=16621664) by Uwe Korn (uwe):*\n[~Paul.Rogers] We already have the necessary builder infrastructure, this function is mainly to have something to pass around when there is no data. Also the `Table` instance is not meant to be modified, i.e. it will stay empty all along the pipeline."
        },
        {
            "created_at": "2018-09-20T11:53:43.640Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-3267?focusedCommentId=16621883) by Krisztian Szucs (kszucs):*\nIssue resolved by pull request 2589\n<https://github.com/apache/arrow/pull/2589>"
        }
    ]
}