{
    "issue": {
        "title": "[Website] Visual identity guidelines for Apache Arrow logo",
        "body": "***Note**: This issue was originally created as [ARROW-15684](https://issues.apache.org/jira/browse/ARROW-15684). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe Apache Arrow logo is not currently documented on the website, and we don't have guidelines about how (or when) people in the community can use adapt it. Now that Arrow is a mature project it would be useful to include this documentation on the site, and to make it easy for people to download \"officially supported\" versions of the Apache Arrow logo for inclusion in slide decks, websites, etc.\r\n\r\nAs a related matter, the website currently uses a less-than-ideal image as the social media preview file. There are two limitations: (1) because it uses black text against a transparent background it isn't readable for twitter users with dark mode set (it just looks all black), and (2) it doesn't have wide enough borders, and parts of the logo get cropped out by twitter previews.\r\n\r\nTo help improve all this, I've put together a concrete proposal in a PR that:\r\n \\* Documents the visual design of the Apache Arrow logo\r\n \\* Generates multiple versions of the logo suitable for different contexts\r\n \\* Provides some guidelines for usage that hopefully aren't too restrictive\r\n \\* Adds this as a \"visual identity\" page to the website, and\r\n \\* Switches the social preview image to one that works on twitter\r\n\r\nThe pull request itself is here:\r\n\r\n<https://github.com/apache/arrow-site/pull/194> \r\n\r\nIf you want a quick preview of what the page would look like on the website it's more or less identical to the README in this repo:\r\n\r\n<https://github.com/djnavarro/arrow-visual-identity>\r\n\r\n(As an aside, this is my first time opening an issue on Jira. My apologies if I have done some part of this incorrectly)",
        "created_at": "2022-02-14T23:41:28.000Z",
        "updated_at": "2022-02-17T18:02:42.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Website",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2022-02-17T18:02:42.000Z"
    },
    "comments": []
}