{
    "issue": {
        "title": "[R] More improvements to developer docs",
        "body": "***Note**: This issue was originally created as [ARROW-14218](https://issues.apache.org/jira/browse/ARROW-14218). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\n- Add link to the main contributions guidelines\n  \n- Add a test of \"how I know that my dev setup is OK?\" to the end of the R-only step\n  \n- The R-only instructions just have instructions on how to install libarrow but we should add a little about how to connect it up with the repo clone; the instructions mention it in the Linux version but could be more explicit\n  \n- When a user clones the repo via RStudio it creates an .rproj file in the root directory - we should add an instructions to clone the arrow fork from the command line so we can use the project's .rproj file\n  \n- We should consider removing the instruction for installing the released version of libarrow (or demoting it to the second place and explain why we'd use it) as typically a dev would want the dev version\n  \n- Mac - you can't just install openssl, you need to add it to your path as LibreSSL is the default - we should add instructions about this\n  \n- Better demarcation between \"special instructions for Linux\" and the next section - maybe use tabs again?\n  \n- clarification of the difference between the build directory and the installation directory\n  \n  \n  \n  \n",
        "created_at": "2021-10-05T09:48:10.000Z",
        "updated_at": "2022-10-27T20:46:22.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: R",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2022-10-27T20:46:22.000Z"
    },
    "comments": [
        {
            "created_at": "2022-10-27T20:46:22.791Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-14218?focusedCommentId=17625329) by Nicola Crane (thisisnic):*\nClosing this as many changes have been made since it was opened and it is stale."
        }
    ]
}