{
    "issue": {
        "title": "C++/Python: Add cast function on Column-level",
        "body": "***Note**: This issue was originally created as [ARROW-1734](https://issues.apache.org/jira/browse/ARROW-1734). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nAdd a `Cast` function on a column level that casts all underlying arrays.\r\n\r\nThere are three possible options we could implement:\r\n\r\n \\* Make a special cast implementation that takes a ChunkedArray and returns a simple Array\r\n \\* Make a universal implementation that takes a ChunkedArray and applies a Kernel on each Array, returning a ChunkedArray with the same chunking\r\n \\* Make a universal implementation that takes a ChunkedArray and applies a Kernel on each Array, returning a plain Array with no chunking",
        "created_at": "2017-10-26T13:22:45.000Z",
        "updated_at": "2017-11-27T21:18:36.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2017-11-27T21:18:36.000Z"
    },
    "comments": [
        {
            "created_at": "2017-10-26T13:35:12.269Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1734?focusedCommentId=16220434) by Wes McKinney (wesm):*\nI would say option 2 is the simplest thing. It would be great to be able to do option 3 eventually, but we'd need to do a little work to enable the cast kernels to write into sliced outputs. We will likely want to have the option to either map the chunks independently (which will always be required for string / variable length output) or write output into a single large array. I'll open a JIRA for that (since if the offset is non-zero, the implementations are incorrect)"
        },
        {
            "created_at": "2017-11-27T21:18:36.130Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1734?focusedCommentId=16267575) by Wes McKinney (wesm):*\nThis was done – ChunkedArray yields ChunkedArray out. We can later optimize for writing into a contiguous output array if we like (after ARROW-1735 is done)"
        }
    ]
}