{
    "issue": {
        "title": "[C++] C++ array kernels framework and execution buildout (umbrella issue)",
        "body": "***Note**: This issue was originally created as [ARROW-8894](https://issues.apache.org/jira/browse/ARROW-8894). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nIn the wake of ARROW-8792, this issue is to serve as an umbrella issue for follow up work and associated \"buildout\" which includes things like:\r\n\r\n- Implementation of many new function types and adding new kernel cases to existing functions\n- Adding implicit casting functionality to function execution\n- Creation of \"bound\" physical array expressions and execution thereof\n- Pipeline execution (executing multiple kernels while eliminating temporary allocation)\n- Parallel execution of scalar and aggregate kernels (including parallel execution of pipelined kernels)\n  \n  There's quite a few existing JIRAs in the project that I'll attach to this issue and I'll open plenty more issues as things occur to me to help organize the work. ",
        "created_at": "2020-05-22T21:01:44.000Z",
        "updated_at": "2021-08-04T12:25:23.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2021-05-12T12:24:51.146Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-8894?focusedCommentId=17343212) by Antoine Pitrou (apitrou):*\n`[~icook]` You may want to consolidate this with your own umbrella issues :)"
        },
        {
            "created_at": "2021-05-12T13:00:00.117Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-8894?focusedCommentId=17343234) by Ian Cook (icook):*\n`[~apitrou]` yes, thanks. This umbrella already has a large number of child issues, so following the example of ARROW-555, I am creating sub-umbrellas to cover specific areas of work under this larger umbrella. I have started by creating ARROW-12748 (arithmetic kernels for numeric arrays) which is linked as a child of this umbrella and has several child issues itself. Organizing issues into a hierarchical parent/child structure like this should improve legibility."
        }
    ]
}