{
    "issue": {
        "title": "[C++] Introduce Substrait ToProto/FromProto conversion options",
        "body": "***Note**: This issue was originally created as [ARROW-16988](https://issues.apache.org/jira/browse/ARROW-16988). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe goal of ARROW-16860 and in general one of the goals of the Substrait consumer effort thus far, is to enable round-tripping between Substrait and Acero plans. However, this begs the question what constitutes round-tripping: are we talking about a perfect reproduction of a Substrait plan after converting it to and from Acero (and/or vice-versa?), or we just talking about functionally-equivalent plans, or is it something in between?\r\n\r\nThis is kind of a rhethorical question because I think it depends on the use case. We've been doing the former thus far to help prove correctness, but this has various problems. For example:\r\n\r\n- Substrait plans contain meaningless information that cannot be represented in Acero, such as the order in which extensions are defined or the anchors used to refer to them. Plans are functionally and structurally indistinguishable even if this information is lost.\n- Protobuf itself also contains meaningless information, because the order in which fields are defined on the wire is undefined, and not even consistent between serializations (hence the existence of [CheckMessagesEquivalent](https://github.com/apache/arrow/blob/2a2d01d70e4e93cad07562f7df9c5d5ccf8e9840/cpp/src/arrow/engine/substrait/serde.h#L196-L208)).\n- (I'm guessing) Acero plans also contain functionally meaningless information (like intermediate column names) that Substrait cannot represent, at least not without advanced extensions.\n- The Substrait and Arrow type systems are quite different; tracking the conversion between them in a way that loses no (meta-)information is difficult. For example, Acero always encodes field names in schemas, while Substrait only does this at the input and output.\n- Substrait and Acero deal with projections and expressions in fundamentally different ways (see ARROW-16986).\n  \n  The approach thus far has been to just reject an incoming plan if it contains something that can't be round-tripped exactly (at least according to CheckMessagesEquivalent), but this behavior is far too pedantic to be useful in practice, since it rejects perfectly valid and executable plans. For example, optimizations (hints) specified in advanced extensions [can be freely ignored](https://github.com/substrait-io/substrait/blob/a79eb07a15cfa157e795f028a83f746967c98805/proto/substrait/extensions/extensions.proto#L75-L77) but are currently rejected.\n  \n  Rather than trying to answer this question, I'd suggest adding a method to specify conversion options. Initially I suggest a single enum with the following variants:\n  \n- pedantic conversion: reject plans that are known to not round-trip even if they are valid.\n- structure-preserving conversion: accept plans even if they won't round-trip, but preserve the relation structure of the incoming plan completely.\n- best-effort conversion: accept plans even if they won't round-trip, and avoid regressions in terms of optimality of the plan caused by the conversion, potentially changing the relation structure, thus allowing for \"optimizations\" like ARROW-16986.\n  \n  The enum should be in an options struct though, so more options can be added later without having to add more arguments to the conversion functions (see also ARROW-16987).\n",
        "created_at": "2022-07-06T12:48:09.000Z",
        "updated_at": "2022-07-29T04:52:41.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2022-07-28T21:41:05.000Z"
    },
    "comments": [
        {
            "created_at": "2022-07-28T21:41:05.955Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16988?focusedCommentId=17572667) by Weston Pace (westonpace):*\nIssue resolved by pull request 13537\n<https://github.com/apache/arrow/pull/13537>"
        }
    ]
}