{
    "issue": {
        "title": "[R] Read/Write_feather stuck forever after bad write, R, Win32",
        "body": "***Note**: This issue was originally created as [ARROW-12700](https://issues.apache.org/jira/browse/ARROW-12700). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nI currently have to switch R kernels to able to work with feather files due to the following bug:\r\n\r\n \r\n\r\nI imported 11 million rows from a csv file using data.table. I then proceeded write_feathering it to a file which got stuck forever without any progress being made. I killed RStudio, then saw the 0 byte feather file gain a couple of Mb; I repeated this process and it just seems like it's working very, very slowly to produce the file. I decided to abort attempts on writing a feather file, but something happened with wherever it is caching the files, because the arrow-package won't allow read_feather to be executed (it's just stuck in a forever-loop with no progress being made).\r\n\r\nI was able to alleviate this by changing R kernel to 4.0.3 from 4.0.4 which allowed read_feather to work again. After accidentally executing the write_feather function again and getting stuck in the loop, read_feather will no longer work again.\r\n\r\n\r\nMy theory is that whatever bug in the process for write_feather is occuring, it is creating some physical file that locks the rest of the feather-code to work, even after restarting the computer and cleaning all temporary files. The only solution seems to be to change R kernels, I've so far not been able to 'reset' the kernel, removing the arrow package and reinstalling it does not seem to solve it.\r\n\r\n \r\n\r\nImporting the CSV file and writing it in Python did not create the same problem, the file was written in seconds.",
        "created_at": "2021-05-08T10:52:12.000Z",
        "updated_at": "2021-09-29T18:45:37.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: R",
            "Type: bug"
        ],
        "closed": true,
        "closed_at": "2021-09-29T18:45:37.000Z"
    },
    "comments": [
        {
            "created_at": "2021-05-08T10:59:38.883Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-12700?focusedCommentId=17341274) by Navid (ngonic):*\narrow::set_cpu_count(4) #less than max\r\n\r\nseems to allow read_feather to proceed, may be related to https://issues.apache.org/jira/browse/ARROW-11579"
        },
        {
            "created_at": "2021-09-29T18:45:37.966Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-12700?focusedCommentId=17422331) by Neal Richardson (npr):*\nWe believe that this has been resolved in ARROW-8379. If you still experience this with version 6.0.0 or greater (after it is released in mid-October), please open a new issue."
        }
    ]
}