{
    "issue": {
        "title": "[Python] Write support for int96",
        "body": "***Note**: This issue was originally created as [ARROW-1120](https://issues.apache.org/jira/browse/ARROW-1120). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nHi there,\n\nI am trying to use pyarrow to convert CSV files to Parquet for use with Redshift Spectrum.  I've got everything sorted... almost :)\n\nUnfortunately, the only format they accept for timestamp columns is int96.  I understand that int96 timestamps are unofficial/deprecated, but unfortunately it's what I am stuck with for integrating with, at least for the moment.  I contacted Amazon support and 64-bit timestamp support has been added to the list of feature requests, but it's unclear when it will be prioritized/added/released.\n\nIn the meantime, I am thinking of adding write support for int96 columns to arrow.  Would that be a welcome addition?\n\nThanks,\nColin\n",
        "created_at": "2017-06-15T16:27:15.000Z",
        "updated_at": "2017-07-18T19:18:10.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2017-07-18T19:18:10.000Z"
    },
    "comments": [
        {
            "created_at": "2017-06-15T18:12:38.460Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1120?focusedCommentId=16050894) by Uwe Korn (uwe):*\nFeel free to make a PR to add Int96 write support. Most of the work is probably in parquet-cpp where we already have a read support for Int96 thus testing the new code should be quite easily. Also you will have to add a flag in pyarrow & parquet-cpp to select the target timestamp type for the Parquet files.\n\ncc `[~rdblue]`: Two cases for the highlight: I thought Spectrum/Athena are Presto-based, is there no int64-timestamp support there? Also adding Int96 write support to parquet-cpp will help us get some parquet-cpp/pyarrow usage in this case but also harm the deprecation of Int96."
        },
        {
            "created_at": "2017-06-16T00:03:40.851Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1120?focusedCommentId=16051218) by Wes McKinney (wesm):*\nIt's possible that Redshift's Parquet support was forked from Impala's scanner which might explain the situation. We'd be happy to accept patches for this in parquet-cpp, and it would require threading a couple parameters through the Python bindings in pyarrow. Let us know if you need help!"
        },
        {
            "created_at": "2017-06-19T16:21:23.619Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1120?focusedCommentId=16054269) by Ryan Blue (rdblue):*\nI don't think Presto has support for the int64 timestamps. I'd recommend using an int64 with a timestamp in milliseconds for now. That's what we use because we can control behavior and know what we are getting that way, instead of int96 where you can get different values depending on versions and processing engine. I think it is a better idea to spend time on support for the types that are well defined and don't have the historical baggage."
        },
        {
            "created_at": "2017-07-16T23:47:56.914Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1120?focusedCommentId=16089189) by Wes McKinney (wesm):*\nSupport for writing deprecated int96 timestamps landed in parquet-cpp today (thanks Colin and Uwe!) https://github.com/apache/parquet-cpp/commit/e998dfb40403197dbb8efa53d077449c81552d26, so we should be able to thread this option through to the Python API without _too_ much work. I will take a look hopefully soon"
        },
        {
            "created_at": "2017-07-17T16:38:47.236Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1120?focusedCommentId=16090048) by Uwe Korn (uwe):*\nI'll take care of this today."
        },
        {
            "created_at": "2017-07-18T14:28:49.174Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1120?focusedCommentId=16091623) by Uwe Korn (uwe):*\nPR: https://github.com/apache/arrow/pull/865"
        },
        {
            "created_at": "2017-07-18T19:18:10.392Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1120?focusedCommentId=16092036) by Wes McKinney (wesm):*\nIssue resolved by pull request 865\n<https://github.com/apache/arrow/pull/865>"
        }
    ]
}