{
    "issue": {
        "title": "[C++][Compute] Introduce Bloom filters to hash join",
        "body": "***Note**: This issue was originally created as [ARROW-15239](https://issues.apache.org/jira/browse/ARROW-15239). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nBloom filters are a common way to improve performance of hash joins where many rows on the probe side of the hash join do not have matches on the build side. Bloom filters are often able to reduce the cost of eliminating such rows early in the processing pipeline, since they are cheaper to probe than the hash join hash table, but they can return false positives for a reasonably small percentage of inputs.\r\n\r\nThis task is about introducing a data structure of register blocked Bloom filter implementation (a practical modification of Bloom filter concept that is specifically tuned for use in query processing related to hash joins and both more space efficient and less costly than using hash table for filtering). The data structure should provide functionality for parallel construction from a vector of exec batches accumulated in memory and vectorized lookup and filtering for a single exec batch. It should not have a limit on the size of the Bloom filter (the number of inserted hashes), which requires using 64-bit hashes for larger inputs. It should be verified that build and probe costs are reasonable low and false positives rate is at most few percent (which should be acceptable in use for query processing).",
        "created_at": "2022-01-03T20:37:35.000Z",
        "updated_at": "2022-03-25T16:12:12.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2022-03-24T08:19:58.000Z"
    },
    "comments": [
        {
            "created_at": "2022-01-14T12:20:24.838Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15239?focusedCommentId=17476100) by Krisztian Szucs (kszucs):*\nSince the PR is in draft I'm postponing it to 8.0"
        },
        {
            "created_at": "2022-03-24T08:19:58.633Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15239?focusedCommentId=17511678) by Weston Pace (westonpace):*\nIssue resolved by pull request 12067\n<https://github.com/apache/arrow/pull/12067>"
        }
    ]
}