{
    "issue": {
        "title": "[Website] Change home page heading text to match GitHub repo description",
        "body": "***Note**: This issue was originally created as [ARROW-14086](https://issues.apache.org/jira/browse/ARROW-14086). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nIn May there was a discussion on the Arrow dev mailing list about shortening the description of Apache Arrow that appears on its GitHub repo page. The discussion is archived at[ https://lists.apache.org/thread.html/rccd9848550e4b606ff80295d152419e4c5486a7be14e239ee21c53fd%40%3Cdev.arrow.apache.org%3E](https://lists.apache.org/thread.html/rccd9848550e4b606ff80295d152419e4c5486a7be14e239ee21c53fd%40%3Cdev.arrow.apache.org%3E).\r\n\r\nThe outcome of this was that the description was changed from\r\n> Apache Arrow is a cross-language development platform for in-memory\n> data. It specifies a standardized language-independent columnar memory\n> format for flat and hierarchical data, organized for efficient\n> analytic operations on modern hardware. It also provides computational\n> libraries and zero-copy streaming messaging and interprocess\n> communication…\r\nto\r\n> Apache Arrow is a multi-language toolbox for accelerated data interchange and in-memory processing\r\nI think we should change the heading text on [https://arrow.apache.org](https://arrow.apache.org/) to match this new description in the GitHub repo. The goal here is not to make the website heading text shorter, but to be more consistent.\r\n\r\nCurrently the website heading text reads:\r\n> A cross-language development platform for in-memory analytics\r\nI think we should change it to:\r\n> A multi-language toolbox for accelerated data interchange and in-memory processing\r\n ",
        "created_at": "2021-09-22T22:34:58.000Z",
        "updated_at": "2021-09-22T22:42:25.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Website",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": []
}