{
    "issue": {
        "title": "[C++] Filter which files to be read in as part of filesystem, filtered using a string",
        "body": "***Note**: This issue was originally created as [ARROW-15943](https://issues.apache.org/jira/browse/ARROW-15943). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThere is a report from a user (see this Stack Overflow post [1]) who has used the `basename_template` parameter to write files to a dataset, some of which have the prefix `\"summary\"` and others which have the prefix \"`{}prediction\"{`}.  This data is saved in partitioned directories.  They want to be able to read back in the data, so that, as well as the partition variables in their dataset, they can choose which subset (predictions vs. summaries) to read back in.  \r\n\r\nThis isn't currently possible; if they try to open a dataset with a list of files, they cannot read it in as partitioned data.\r\n\r\nA short-term solution is to suggest they change the structure of how their data is stored, but it could be useful to be able to pass in some sort of filter to determine which files get read in as a dataset.\r\n\r\n \r\n\r\n[1] [https://stackoverflow.com/questions/71355827/arrow-parquet-partitioning-multiple-datasets-in-same-directory-structure-in-r)](https://stackoverflow.com/questions/71355827/arrow-parquet-partitioning-multiple-datasets-in-same-directory-structure-in-r_)",
        "created_at": "2022-03-15T17:21:50.000Z",
        "updated_at": "2022-08-09T21:43:08.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-08-09T09:49:43.376Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15943?focusedCommentId=17577326) by Nicola Crane (thisisnic):*\nThere is more user interest in implementing this feature: https://stackoverflow.com/questions/73283669/r-arrowread-datasetmyfolder-only-read-some-folders-files"
        },
        {
            "created_at": "2022-08-09T15:00:56.641Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15943?focusedCommentId=17577474) by Weston Pace (westonpace):*\nI could see a few different ways this could be implemented:\r\n\r\n \\* We could add support for exclusion / inclusion filters for dataset discovery.  These could be regular expressions that are applied to the filenames to determine whether we should or should not include them.\r\n \\* We could do more to support custom partitioning functions.  The user could then create their own partitioning which includes this part of the filename as a partitioning column.\r\n \\* We could (not sure if we support this today or not) make sure we support filtering based on the filename column.  However, this approach has the downside of loading all the unwanted data into memory.\r\n\r\nDo any of those approaches seem more appealing than the others?"
        },
        {
            "created_at": "2022-08-09T20:52:45.524Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15943?focusedCommentId=17577621) by Nicola Crane (thisisnic):*\nI'm not sure.\r\n\r\nFrom an R perspective, if it's an option, I think it would be fine to support passing in a list of filenames but still being able to use the directory names as dataset variables, if that's possible (as R users are likely to be comfortable pre-filtering the list of files).  This feels like it would fit with option 3; I am currently working on ARROW-15260 which would allow users to add the fragment filename as a column, which they could then use to filter on (though I recall in a conversation on that PR or ticket, you mentioning that we can't properly do pushdown filtering yet using that?)  However, you mention the issue of loading the unwanted data into memory - I guess for these users they might choose to use something other than arrow if this was acceptable to them.\r\n\r\nOption 1 sounds good too.\r\n\r\nI don't fully understand what option 2 would look like, but if it's something we could wrap in R to achieve solutions to the 2 linked Stack Overflow questions, then great.  \r\n\r\nUltimately, I don't think there's an obvious best approach here, and that solving for the simplest case (\"I have directories containing files, which I wish to both selectively load in some files from, but also use the directory structure to create variables\") will get us most of the way there unless any super-specialist use cases emerge later.  Option 1 sounds potentially simplest?\r\n\r\n\r\n"
        },
        {
            "created_at": "2022-08-09T21:42:58.651Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15943?focusedCommentId=17577637) by Weston Pace (westonpace):*\nI agree that option 1 is the simplest and probably preferred option."
        }
    ]
}