{
    "issue": {
        "title": "[Rust] [Datafusion] Why is DataFusion part of the Arrow repo?",
        "body": "***Note**: This issue was originally created as [ARROW-8451](https://issues.apache.org/jira/browse/ARROW-8451). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nDatafusion is a great example of how to use Arrow. But having Datafusion inside the Arrow project has several drawbacks:\r\n \\* longer build times (rust build already slooooow)\r\n \\* more frequent updates (creates noise)\r\n \\* its roadmap can be quite independent of that of Arrow\r\n\r\nWhat is the actual benefit of having Datafusion inside the Arrow repo?",
        "created_at": "2020-04-14T16:20:30.000Z",
        "updated_at": "2020-04-14T16:59:02.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Rust - DataFusion",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2020-04-14T16:59:02.000Z"
    },
    "comments": [
        {
            "created_at": "2020-04-14T16:38:09.890Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-8451?focusedCommentId=17083406) by Andy Grove (andygrove):*\nIt should be possible to make DataFusion an optional crate in the workspace so that the core Arrow crates can be built without building DataFusion. That might be worth looking into. It is already possible to build the other crates independently by running `cargo build` in the appropriate directories instead of from the root of the workspace."
        },
        {
            "created_at": "2020-04-14T16:41:05.946Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-8451?focusedCommentId=17083414) by Andy Grove (andygrove):*\n`[~wesm]` `[~paddyhoran]` `[~nevime]` I'd be interested to hear your opinions on the value (or not) of DataFusion being a part of the Arrow repo at this time. I can certainly see arguments for and against."
        },
        {
            "created_at": "2020-04-14T16:57:19.941Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-8451?focusedCommentId=17083433) by Wes McKinney (wesm):*\nThe issues cited are orthogonal to whether or not DataFusion is developed as part of Apache Arrow.\r\n\r\n- \\***longer build times**\\*: DataFusion need not be built as part of the core Rust Arrow library\n- \\***more frequent updates (creates noise)**\\*: don't understand this point. If it relates to builds then these can be built separately\n- \\***its roadmap can be quite independent of that of Arrow**\\*: don't understand this either. The project contains many components and there are dozens of active developers working toward agendas that are focused in different programming languages. I see no problem with different components of the problem evolving as there is community will\n  \n  Apache projects are primarily about community and governance. We have a saying \"Community over Code\". Issues relating to the code (which are what cited here) are not a good reason to fracture or fragment the community, or cause a part of the community to leave the Apache project. The project's open, community governance model attracts contributors and enterprises to the project because they know that the PMC has an obligation to protect them and their contributions from bad actors. \n  \n  If the DataFusion code is a nuisance to Rust core users, then its build process can be made more separate from the core project. "
        },
        {
            "created_at": "2020-04-14T16:59:02.911Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-8451?focusedCommentId=17083436) by Wes McKinney (wesm):*\nSince this matter relates to governance let us continue further discussions on dev@arrow.apache.org"
        }
    ]
}