{
    "issue": {
        "title": "[C++] Reconcile type promotion rules between if_else, case_when, coalesce, select",
        "body": "***Note**: This issue was originally created as [ARROW-14105](https://issues.apache.org/jira/browse/ARROW-14105). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThese functions are all conceptually similar and need to promote argument types to a common type. Right now they all have different type promotion heuristics, and there are a few in-progress PRs to improve type support; once those land, we should also reconcile the type promotion logic they use - presumably, all of them should be able to use the exact same logic in the end.",
        "created_at": "2021-09-23T17:20:41.000Z",
        "updated_at": "2022-07-12T14:04:18.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2021-09-29T15:45:44.307Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-14105?focusedCommentId=17422203) by David Li (lidavidm):*\nIn particular, one thing that needs improvement is dictionary handling. Right now the type promotion values don't get applied to indices/values; we should do things like reconcile `dictionary<int8, utf8>` and `dictionary<int32, binary>` to `dictionary<int32, binary>`. It may be worth making the type promotion helpers iterator-based so that we can try to treat dictionaries uniformly as well, instead of having to copy descriptors around (though this requires the implementation to be in the header, unfortunately)."
        },
        {
            "created_at": "2022-07-12T14:04:18.545Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-14105?focusedCommentId=17565518) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}