{
    "issue": {
        "title": "[C++] ORC in build breaks code using Arrow and not ORC -- not reproducible",
        "body": "***Note**: This issue was originally created as [ARROW-17344](https://issues.apache.org/jira/browse/ARROW-17344). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nAfter building Arrow from source, with ORC enabled and retrieved from a package manager, I went to build some software that did not use ORC, and was unable to compile because ORC was not found by Arrow internals, and I didn't include ORC in my final CMake file (the one for my Arrow-using program), because I simply wasn't using it.\r\n\r\nI rebuilt Arrow without ORC for now, but the ability to include ORC as a feature in Arrow and not have to include it in future CMakes when ORC isn't in use would be nice.",
        "created_at": "2022-08-08T20:31:49.000Z",
        "updated_at": "2022-08-09T18:24:36.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: bug"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-08-08T20:34:35.099Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17344?focusedCommentId=17576978) by David Li (lidavidm):*\nAre you able to share the error CMake gave, and the original `cmake` command, or are those gone by now?"
        },
        {
            "created_at": "2022-08-08T20:37:27.599Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17344?focusedCommentId=17576979) by Kae Suarez (ksuarez):*\nThat is gone, but I can go ahead and rebuild with the system ORC again to reproduce within the next day or so, in order to provide it.\r\n\r\nAs for the error, it came it at compile-time when compiling my Arrow-using software – internals to Arrow, like Datasets, would error out because their ORC includes couldn't find ORC."
        },
        {
            "created_at": "2022-08-09T18:23:59.768Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17344?focusedCommentId=17577573) by Kae Suarez (ksuarez):*\nUnfortunately, recompiling with ORC on just worked out. Maybe it just grabbed the include path correctly this time. I'll switch the status until someone can reproduce this."
        }
    ]
}