{
    "issue": {
        "title": "Add _O_NOINHERIT to the file open flags on Windows",
        "body": "***Note**: This issue was originally created as [ARROW-3936](https://issues.apache.org/jira/browse/ARROW-3936). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nUnlike Linux, Windows doesn't let you delete files that are currently opened by another process. So if you create a child process while a Parquet file is open, with the current code the file handle is inherited to the child process, and the parent process can't then delete the file after closing it without the child process terminating first.\r\n\r\nBy default, Win32 file handles are not inheritable (likely because of the aforementioned problems). Except for _wsopen_s, which tries to maintain POSIX compatibility.\r\n\r\nThis is a serious problem for us.\r\n\r\nWe would argue that specifying _O_NOINHERIT by default in the _MSC_VER path is a sensible approach and would likely be the correct behaviour as it matches the main Win32 API.\r\n\r\nHowever, it could be that some developers rely on the current inheritable behaviour. In which case, the Arrow public API should take a boolean argument on whether the created file descriptor should be inheritable. But this would break API backward compatibility (unless a new overloaded method is introduced).\r\n\r\nIs forking and inheriting Arrow internal file descriptor something that Arrow actually means to support?\r\n\r\nSee <https://github.com/apache/arrow/pull/3085.> What do we think of the proposed fix?",
        "created_at": "2018-12-04T14:40:55.000Z",
        "updated_at": "2019-06-03T12:24:52.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: bug"
        ],
        "closed": true,
        "closed_at": "2018-12-05T10:59:32.000Z"
    },
    "comments": [
        {
            "created_at": "2018-12-05T10:59:32.380Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-3936?focusedCommentId=16709918) by Antoine Pitrou (apitrou):*\nIssue resolved by pull request 3085\n<https://github.com/apache/arrow/pull/3085>"
        }
    ]
}