{
    "issue": {
        "title": "[R] Refactor R <-> Array conversion",
        "body": "***Note**: This issue was originally created as [ARROW-7798](https://issues.apache.org/jira/browse/ARROW-7798). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThere's a bit of technical debt accumulated in array_to_vector and vector_to_array:\r\n \\* Mix of conversion **and** casting, ideally we'd move casting out of there (at the cost of more memory copy). The rationale is that the conversion logic will differ from the CastKernels, e.g. when to raise errors, benefits from complex conversions like timezone... The current implementation is fast, e.g. it fuses the conversion and casting in a single loop at the cost of code clarity and divergence.\r\n \\* There should be 2 paths, zero-copy, non zero-copy. The non-zero copy should use the newly introduced VectorToArrayConverter which will work with complex nested types.\r\n \\* The in array_to vector, Converter should work primarily with Array and not ArrayVector\r\n \\* The vector_to_array should not use builders, sizes are known, the null bitmap should be constructed separately. There's probably a chance that we can re-use R's memory with zero-copy for the raw data.\r\n \\* There seem to be multiple paths that do the same conversion: <https://github.com/apache/arrow/pull/7514#discussion_r446706140>",
        "created_at": "2020-02-07T18:41:36.000Z",
        "updated_at": "2022-07-12T14:04:51.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: R",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2020-02-07T18:42:55.396Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-7798?focusedCommentId=17032587) by Francois Saint-Jacques (fsaintjacques):*\nFollowup."
        },
        {
            "created_at": "2022-07-12T14:04:51.036Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-7798?focusedCommentId=17565790) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}