{
    "issue": {
        "title": "[JS] Implement JavaScript-compatible implementation",
        "body": "***Note**: This issue was originally created as [ARROW-541](https://issues.apache.org/jira/browse/ARROW-541). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nI would really like to see an implementation of Arrow that is compatible with NodeJS and modern web browsers. This would enable streaming columnar data to the browser without an intermediate conversion to JSON – I could imagine web-based data visualization systems would benefit substantially from this functionality. \n\nBecause Google's Flatbuffers library has first-class JS support, this should be achievable. Carlos Scheidegger created a prototype implementation of the Feather file format (basically: mini-Arrow) last year: https://github.com/wesm/feather/tree/master/js\n\nThis JIRA can be an umbrella issue for the JS implementation. As soon as we find interested contributors to work on this, we can create JIRAs and attach them to this issue until we reach a certain level of maturity.\n\nWithout starting a bike shed discussion, I humbly request that the implementation be done in TypeScript https://www.typescriptlang.org/",
        "created_at": "2017-02-07T22:20:08.000Z",
        "updated_at": "2019-06-03T13:13:28.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: JavaScript",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2017-11-29T23:00:19.000Z"
    },
    "comments": [
        {
            "created_at": "2017-02-08T03:42:07.025Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-541?focusedCommentId=15857332) by Dan Robinson (danrobinson010@gmail.com):*\nI'm interested in contributing to a JS/Node implementation. Here's one I worked on last year: https://github.com/danrobinson/jsarrow. It is probably out of date with the spec and certainly the C++ implementation (with which it was fairly tightly coupled), so I'd be fine starting from scratch if you or others have a roadmap in mind, and maybe cannibalizing it for parts (like the C++ bindings).\n\n+1 to TypeScript (another reason I would scrap most of that old repo)."
        },
        {
            "created_at": "2017-02-10T19:59:04.703Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-541?focusedCommentId=15861779) by Brian Hulette (hulettbh):*\nI'm also interested in contributing. I worked on a (very basic) library last fall focused on reading arrow files in the browser/node for data visualization. Unfortunately its a private repo and I can't link it here but I've got the go-ahead to cannibalize parts of it for an official implementation.\n\nTypeScript does seem like the way to go for this."
        },
        {
            "created_at": "2017-02-22T15:00:38.178Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-541?focusedCommentId=15878391) by Rick Fanta (Rick Fanta):*\nI'm also interested.  Have worked on a lot of demanding projects using Java + Python (sadly for closed-source investment banks), and my code quality is generally pretty good.   Happy to adopt code styles from high quality Typescript projects and put in some good sweat equity to implement an implementation that the community can be happy with..\n\nI'm esp. interested in getting cool projects like this to work with Arrow (https://github.com/nicolaskruchten/pivottable).  [i.e. Super cool but begging for higher quality I/O that Arrow would provide.]"
        },
        {
            "created_at": "2017-02-23T17:56:20.079Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-541?focusedCommentId=15880938) by Wes McKinney (wesm):*\nSounds great to me. Once the project is spun up and we have the build and test machinery in place, I can help with a bit of implementation / testing and code review. Good excuse to learn TypeScript also"
        },
        {
            "created_at": "2017-03-04T19:21:52.282Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-541?focusedCommentId=15895831) by Brian Hulette (hulettbh):*\nI ported my original implementation over to TypeScript and opened a PR that includes it: https://github.com/apache/arrow/pull/358\n\nIts still pretty rough around the edges, but it does add the ability to read the arrow file format in the browser and with Node."
        },
        {
            "created_at": "2017-03-15T15:37:16.516Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-541?focusedCommentId=15926378) by Wes McKinney (wesm):*\nI'll add JIRAs to this issue as things develop, once we reach a certain level of feature completeness we can close this JIRA"
        },
        {
            "created_at": "2017-04-21T13:00:22.142Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-541?focusedCommentId=15978690) by Brian Hulette (bhulette):*\n `[~wesmckinn]` should I go through you to create tickets under this one, or just go ahead and write them up myself? I'd like to add some structural things like rename `javascript/` to `js/`, add an `arrow.io` namespace, and also implementations for the streaming format as well as the fixed length list type."
        },
        {
            "created_at": "2017-04-21T14:25:38.484Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-541?focusedCommentId=15978815) by Wes McKinney (wesm):*\nSure, go ahead and create new JIRAs and attach them to this one"
        },
        {
            "created_at": "2017-11-29T23:00:19.786Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-541?focusedCommentId=16271725) by Wes McKinney (wesm):*\nWhile integration tests are still in the works, I think we can call this one closed. Thanks to all!"
        }
    ]
}