{
    "issue": {
        "title": "[C++] Optimize delta buffer creation with partially finishable array builders",
        "body": "***Note**: This issue was originally created as [ARROW-2330](https://issues.apache.org/jira/browse/ARROW-2330). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe main aim of this change is to optimize the building of delta dictionaries. In the current version delta dictionaries are built using an additional \"overflow\" buffer which leads to complicated and potentially error-prone code and subpar performance by doubling the number of lookups.\r\n\r\nI solve this problem by introducing the notion of partially finishable array builders, i.e. builder which are able to retain the state on calling Finish. The interface is based on RecordBatchBuilder::Flush, i.e. Finish is overloaded with additional signature Finish(bool reset_builder, std::shared_ptr<Array>\\* out). The resulting Arrays point to the same data buffer with different offsets.\r\n\r\nI'm aware that the change is kind of biggish, but I'd like to discuss it here. The solution makes the code more straight forward, doesn't bloat the code base too much and leaves the API more or less untouched. Additionally, the new way to make delta dictionaries by using a different call signature to Finish feel cleaner to me.\r\n\r\nI'm looking forward to your critic and improvement ideas.\r\n\r\nThe pull request is available at: https://github.com/apache/arrow/pull/1769",
        "created_at": "2018-03-20T15:44:14.000Z",
        "updated_at": "2018-06-12T21:38:55.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2018-06-12T21:38:55.000Z"
    },
    "comments": [
        {
            "created_at": "2018-06-12T21:38:55.700Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2330?focusedCommentId=16510244) by Wes McKinney (wesm):*\nResolved in PR https://github.com/apache/arrow/pull/1769"
        }
    ]
}