{
    "issue": {
        "title": "[Rust] [DataFusion] Improve performance for grouping/hashing on dictionary encoded data",
        "body": "***Note**: This issue was originally created as [ARROW-11635](https://issues.apache.org/jira/browse/ARROW-11635). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nI am recording this for posterity / potential for someone else to help if they want:\r\n\r\nWhile adding support for GROUP BY hash, `[~jorgecarleitao]` had some great suggestions\r\nhttps://github.com/apache/arrow/pull/9233#issuecomment-762174671\r\n\r\nThe initial GROUP BY implementation hashes the actual value of the dictionary (aka looks up the underlying value). For the common case such as when the dictionary contains strings, this will likely do much more work than is necessary. \r\n\r\nIn the common case we should be able to hash the dictionary indexes directly, or  possibly skip hashing entirely and build an aggregate table directly from the indexes  – this would work incredibly well for low cardinality string columns\r\n\r\nWhat makes it tricky is that we would have to handle the case where the dictionary itself is not the same across all record batches (and thus indexes in one record batch may not correspond to the same value in another)\r\n\r\nSome possibly implementation ideas are:\r\nImplement a special case for a shared dictionary across all input record batches, and have code to switch back to the more general case (hash table) if the dictionary ever changes.\r\n\r\nAlternately, we could hold a hash table (or equivalent) for each distinct dictionary we saw and merge them all at the end. \r\n\r\nThe second approach likely would likely be the fastest, but also would potentially consume the most resources",
        "created_at": "2021-02-15T20:36:05.000Z",
        "updated_at": "2021-12-16T16:59:39.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Rust",
            "Component: Rust - DataFusion",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": []
}