{
    "issue": {
        "title": "[Python] Wrapping PyArrow Table with Numpy without copy",
        "body": "***Note**: This issue was originally created as [ARROW-1925](https://issues.apache.org/jira/browse/ARROW-1925). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe scenario is the following:\r\nI have a parquet file, which has a column containing a float array of constant size.\r\nSo it can be thought of as a matrix.\r\nWhen I read the parquet file, the way I currently access it, is to convert it to pandas, extract the values, giving me a list of np.array and then doing np.vstack to get the matrix.\r\nThis involves a copy that would be nice to avoid.\r\nWhen a parquet file (or more generally a parquet dataset) is read, would the values of the array column be contiguous in memory, so that a view on the data could be created without having to copy? That would be neat.\r\nThanks!",
        "created_at": "2017-12-14T14:43:29.000Z",
        "updated_at": "2019-02-06T04:17:15.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2019-02-06T04:17:15.000Z"
    },
    "comments": [
        {
            "created_at": "2017-12-14T17:23:21.731Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1925?focusedCommentId=16291207) by Wes McKinney (wesm):*\nWe avoid copies when converting from Arrow memory (which may have been materialized from Parquet) to NumPy in many cases, for example numerical data without nulls. When data has nulls or non-numeric data, generally copies are required (since we have to represent the data in some NumPy compatible way, since NumPy is not aware of Arrow's memory layout for null values or strings, for example)"
        },
        {
            "created_at": "2019-02-06T04:17:15.464Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1925?focusedCommentId=16761451) by Wes McKinney (wesm):*\nAs far as I know we have taken advantage of all opportunities to do zero copy where there are no nulls and the Arrow memory format is compatible with NumPy"
        }
    ]
}