{
    "issue": {
        "title": "[Docs] Clarify processes for first-time contributors",
        "body": "***Note**: This issue was originally created as [ARROW-17447](https://issues.apache.org/jira/browse/ARROW-17447). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nPer [this discussion](https://lists.apache.org/thread/hycr4ghh7csspvm9jyffvqh8qo5koobg), improvements should be considered to reduce friction for first-time contributors through documentation of environment setup, CI checks, code review expectations, etc. Some of this exists scattered in various locations throughout documentation (e.g., language-specific development environments are documented), but it can be difficult to find. The [contributing page](https://arrow.apache.org/docs/developers/contributing.html) has some pointers at the bottom.",
        "created_at": "2022-08-17T14:44:56.000Z",
        "updated_at": "2022-08-22T21:01:31.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Component: Documentation",
            "Component: Go",
            "Component: Python",
            "Component: R",
            "Type: task"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-08-17T16:11:17.803Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17447?focusedCommentId=17580864) by Duncan (MacQuarrie):*\nSome notes from a recent first-time contributor.\r\n \\* My route to contribution was _not_ \"go to project website, go to contributing page, drill down from there\".\r\n \\* Rather, it was:\r\n \\*\\* at work, I am working on a large codebase which uses pyarrow;\r\n \\*\\* I found a gap in functionality and believed I could fill it with a [PR](https://github.com/apache/arrow/pull/13633);\r\n \\*\\* The natural path seemed to be to find the pyarrow project on GitHub and find my way from there.\r\n\r\nRightly or wrongly, I did not know about [this page](https://arrow.apache.org/docs/developers/contributing.html) until this docs ticket was opened; admittedly I missed its mention at the bottom of [CONTRIBUTING.md](https://github.com/apache/arrow/blob/master/CONTRIBUTING.md) (which I looked for and found at the start, per open-source convention).\r\n\r\nMy expectation was that the repo's contributing directions would include something like:\r\n \\* \"Clone the repo and do `docker-compose up test` to run the pyarrow test suite.\"\r\n \\* \"Our CI system has steps foo, bar, and baz. Once these steps pass on your PR, please contact the CODEOWNERS of the relevant part of the source tree for review.\"\r\n \\* \"Discussion takes place on mailing list X.\"\r\n \\* \"The process from raising of PR to release is <snip>.\"\r\n\r\nThe actual situation that played out was as follows:\r\n \\* From VSCode on an M1 Mac, I did not know where to begin to build or test anything, or even if it would work on M1.\r\n \\* I created a Jira account and ticket as directed, and started a PR. (I could not `Start Progress` on the ticket, but this has since been fixed.)\r\n \\*\\* It might be worth mentioning in docs that use of Jira is just standard practice in Apache projects: to me it felt somewhat \"against-the-grain\".\r\n \\* There were some pleasant surprises at this point for which I think the Arrow regulars should be proud of themselves:\r\n \\*\\* response to the Jira ticket was quick;\r\n \\*\\* response to the PR was quick and seemingly automatic: I don't know how awareness of it came about but I soon had constructive comments from people whom I assume to be maintainers;\r\n \\*\\* everyone was very patient and there was no hint of any unsporting comments;\r\n \\*\\* I do not mean to sound in any way patronising in saying all this; I was honestly pleasantly surprised that this large project seems free from inane, low-quality or LKML-tier abusive comments. {**}That's as it should be{**}, but sadly first-time contributors may be bracing themselves for a harsh experience, as I had been.\r\n \\* I did not know how to build or test anything locally; I had never heard of Cython; it's been 20+ years since I last looked at K&R, so the baptism of fire entailed:\r\n \\*\\* make a change, push it, wait a while, see what CI says\r\n \\*\\* repeat\r\n \\*\\* try not to exhaust the patience of the maintainers who showed up.\r\n \\* The code review was meticulous and I appreciated that, because having quickly found myself in unfamiliar territory of C++ and Cython, I would not like to leave anything to a hand-wavey \"oh it's fine\".\r\n\r\n \r\n\r\nThis is becoming longwinded so I will try to summarise:\r\n\r\n\"What would reduce friction?\"\r\n \\* Reduce CONTRIBUTING.md to no more than a link to the project website's documentation on contributing. Reduces repetition.\r\n \\* One or both of:\r\n \\*\\* \"Here is a one-shot docker command to perform [a subset of] CI checks locally\"\r\n \\*\\* \"Here is a list of dependencies to install on a virgin dev machine\"\r\n \\* Bonus: \"build a pyarrow test package for your own integration testing as follows...\"\r\n \\* Link to the mailing list archives so that people can quickly see the high quality of the community\r\n \\* Outline how and when to invite maintainers to perform a code review, and what expectations to have of them (are they spare-time volunteers? paid full-time?)\r\n \\* Outline the broad strokes of the release cadence(s) for the project.\r\n\r\n@toddfarmer , hope that helps :) "
        },
        {
            "created_at": "2022-08-22T10:59:37.194Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17447?focusedCommentId=17582906) by Alenka Frim (alenka):*\nBig thanks for such good notes `[~MacQuarrie]`!"
        },
        {
            "created_at": "2022-08-22T21:01:31.560Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17447?focusedCommentId=17583196) by Aldrin Montana (octalene):*\n`[~MacQuarrie]` nice notes for sure (and congrats on 1st contribution)"
        }
    ]
}