{
    "issue": {
        "title": "[C++] Improve C++ Orc Adapter performance and memory footprint",
        "body": "***Note**: This issue was originally created as [ARROW-4713](https://issues.apache.org/jira/browse/ARROW-4713). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nCurrently the Arrow C++ provide a naive adapter implementation that allow user to read orc file to Arrow RecordBatch. However, this implementation have several drawbacks:\r\n \\* Inefficient conversion that incurs huge memcpy overhead\r\n \\*\\* currently the ORC adapter are performing byte to byte memcpy to move data to ORC VectorBatch to Arrow RecordBatch regardless of the fact that ORC VectorBatch shares the same memory layout with Arrow in most of the Data Types\r\n \\* Huge memory footprint because the lack of TableReader implementation\r\n \\*\\* The ORC adapter currently only allow user to read data with the unit of stripe. However, as a columnar format with high compression ration, data read from a ORC stripe can potential takes over gigabytes of memory, which makes the ORC adapter not quite usable in production environment.\r\n\r\nHere we propose a new ORC adapter implementation to fix the issues mentioned above:\r\n \\* To reduce conversion overhead, instead of performing naive data copy, the new adapter would be able to fully taking advantage of the memory layout similarity between ORC VectorBatch and Arrow RecordBatch. Namely the new adapter will perform pointer manipulation to transfer the memory ownership from VectorBatch to Arrow RecordBatch whenever possible.\r\n \\* The new ORC Adapter would be able to provide user a row level granularity when reading data from Orc File. The user should be able to specify how many rows should be expected on output RecordBatch and the ORC Adapter should make sure no more the requested number of rows would be returned.",
        "created_at": "2019-02-28T09:02:02.000Z",
        "updated_at": "2022-07-12T14:04:45.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2019-02-28T15:48:11.534Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4713?focusedCommentId=16780654) by Wes McKinney (wesm):*\nSeems like there may be many tasks here, please create sub-tasks if you want to break the work into multiple patches"
        },
        {
            "created_at": "2020-09-24T13:59:05.311Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4713?focusedCommentId=17201546) by Antoine Pitrou (apitrou):*\n[~Yurui Zhou] Are you still planning to work on these issues at some point?"
        },
        {
            "created_at": "2021-01-12T14:50:26.779Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4713?focusedCommentId=17263386) by Krisztian Szucs (kszucs):*\nMoving to 4.0."
        },
        {
            "created_at": "2021-01-18T04:45:55.083Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4713?focusedCommentId=17267009) by Ian Alexander Joiner (yingzhou474):*\nHmm..this looks interesting. If @Yurui Zhou won’t take it I potentially can. However I don’t think I have time for that before July though. So if I will take it it will need to happen half a year later and won’t be available in 4.0."
        },
        {
            "created_at": "2022-07-12T14:04:45.924Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4713?focusedCommentId=17565736) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}