{
    "issue": {
        "title": "[C++] [Python] Tag record batches with start_byte and end_byte infromation",
        "body": "***Note**: This issue was originally created as [ARROW-17380](https://issues.apache.org/jira/browse/ARROW-17380). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nIt might be desirable for a record batch to have information of where it came from in the source dataset. This can be used for a few purposes:\r\n \\* Rereading a particular record batch without rereading the entire fragment\r\n \\* Easily tracking progress of how much a particular (file) dataset has been consumed. \r\n\r\nIt could also be useful for debugging if a record batch resulted in an error downstream. \r\n\r\nThe plan is to add some attribute like this here: <https://github.com/apache/arrow/blob/master/cpp/src/arrow/dataset/scanner.cc#L923> that will be tagged on to the record batch by the Scanner as it is being generated.\r\n\r\nThis is useful for file based formats like CSV. In Parquet this is less necessary since record batches (usually) correspond to row groups and row group ids can be used to serve this function.",
        "created_at": "2022-08-10T21:50:44.000Z",
        "updated_at": "2022-11-09T17:51:39.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-11-09T17:51:39.793Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17380?focusedCommentId=17631185) by Apache Arrow JIRA Bot (arrowjira):*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned per [project policy](https://arrow.apache.org/docs/dev/developers/bug_reports.html#issue-assignment). Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}