{
    "issue": {
        "title": "[C++] Buffers contain uninitialized memory",
        "body": "***Note**: This issue was originally created as [ARROW-2790](https://issues.apache.org/jira/browse/ARROW-2790). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nHi,\r\n\r\ncurrently, buffers can contain uninitalized memory when built with buffer builders. This happens in two ways:\r\n1. The most common implementation of AppendNull(s) adds a null-bit to the null-map and increments the lengths, leaving chunks of data values untouched\n1. The padding is never initialized\n   \n   This can lead to a number of problems, some of more or less theoretical nature, but it's worth fixing just to make valgrind happy again and allow it to run in CI :) Also, leaking uninitialized memory over a wire is never nice, and currently problem 1. ist never mitigated by the ipc writers (although the problem 2 ist). \n   \n   This PR changes the behaviour of AppendNull(s) and FinishInternal for the affected builders and adds a lot of checks to ensure the correct initialization. Most of the test succeed the current master, but cause valgrind warnings, if the buffer builders aren't patched.\n   \n   I decided not to test explicitly if the nulled is really 0, just that it can be read without errors, since the specs don't specify exact values. I check the padded memory values explicitly, but I'm not completely sure, what the best course of action is there: we could also ignore the values in padding just checking if they are initialized, or we could adjust the spec in this point. ",
        "created_at": "2018-07-04T07:30:59.000Z",
        "updated_at": "2018-07-27T15:23:10.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2018-07-09T07:47:04.000Z"
    },
    "comments": [
        {
            "created_at": "2018-07-09T07:47:04.764Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2790?focusedCommentId=16536625) by Philipp Moritz (pcmoritz):*\nIssue resolved by pull request 2216\n<https://github.com/apache/arrow/pull/2216>"
        }
    ]
}