{
    "issue": {
        "title": "[C++][Dataset] Devise a mechanism to limit the total \"system ram\" (process + cache) used by dataset writes",
        "body": "***Note**: This issue was originally created as [ARROW-14635](https://issues.apache.org/jira/browse/ARROW-14635). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe dataset writer now correctly applies backpressure.  However, that backpressure is only applied when the write calls slow down.  This only happens when the OS disk cache fills up.\r\n\r\nHowever, filling up the OS disk cache is undesirable.  It will cause all running processes to get swapped (assuming the system has any swap configured) and will make the system unusable for anything else.\r\n\r\nThis typically has no actual benefit to the dataset write.  The marginal performance boost provided by the extra RAM is often not worth the cost.\r\n\r\nOne way to do this would be to use direct I/O (although that comes with a plethora of warnings).  Another way might be to flag the output was WONTNEED but I don't know for sure if this works (the OS might still cache it so that it can satisfy the write call quickly).  Another way might be to somehow track how much disk cache is being used for writes but that would get complex.  I'm sure there are other ways I'm just not aware of yet.",
        "created_at": "2021-11-08T22:35:01.000Z",
        "updated_at": "2022-10-20T04:54:45.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-03-10T19:34:52.189Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-14635?focusedCommentId=17504538) by Weston Pace (westonpace):*\nJust jotting this down but I did a bit of looking into this and I think a combination of writing the file with O_DSYNC and then using WONTNEED on the written data should accomplish this for Linux, though there may be other ways.\r\n\r\nOn windows there is a flag FILE_FLAG_WRITE_THROUGH which will be key I think"
        }
    ]
}