{
    "issue": {
        "title": "Explore Codespeed feasibility and ease of customization",
        "body": "***Note**: This issue was originally created as [ARROW-4354](https://issues.apache.org/jira/browse/ARROW-4354). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\n@Tanya Schlusser can you please explore this option and report out?",
        "created_at": "2019-01-24T06:34:45.000Z",
        "updated_at": "2022-07-12T14:04:55.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Developer Tools",
            "Type: task"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2019-01-24T14:34:51.906Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4354?focusedCommentId=16751189) by Tanya Schlusser (tanya):*\nNice! One of the contributors on this project, Antoine Pitrou (didn't `at` him but he has commented on the ARROW-4313), has contributed to [Airspeed Velocity (ASV)](https://github.com/airspeed-velocity/asv) which I have been looking at too, and which informed his initial comments on [the mailing list](https://lists.apache.org/thread.html/278e573445c83bbd8ee66474b9356c5291a16f6b6eca11dbbe4b473a@%3Cdev.arrow.apache.org%3E). Here are a benchmarks for a [bunch of pandas-related projects](https://pandas.pydata.org/speed/) using Airspeed Velocity.\r\n\r\nMaybe we can take the best of both worlds, and use the database schema from Codespeed and the mostly static components of ASV. I am very impressed with the functionality of Airspeed Velocity."
        },
        {
            "created_at": "2019-01-24T14:52:47.955Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4354?focusedCommentId=16751203) by Tanya Schlusser (tanya):*\nCodespeed is nice too. [Link to codespeed repo](https://github.com/tobami/codespeed).\r\n\r\nHowever it looks like codespeed is licensed under LGPL v 2.1 — I believe LGPL 3 is the first one that is compatible with Apache; which only means their codebase can't be in the Arrow codebase...maybe not a big deal. I agree the backend is nice and simple is a good thing."
        },
        {
            "created_at": "2019-01-24T16:38:29.626Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4354?focusedCommentId=16751292) by Wes McKinney (wesm):*\n`[~tanya]` there's no issue with depending on codespeed for development work. The only problem with L/GPL projects comes when you have a runtime dependency where you use Arrow _at all_ without it. "
        },
        {
            "created_at": "2019-01-25T00:22:10.758Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4354?focusedCommentId=16751731) by Areg Melik-Adamyan (aregm):*\n`[~tanya]`  - Codespeed is not going to be checked-in into Arrow repo or redistributed as a part of Arrow project. We are using it the same way we are using Linux. The changes to the sources should be published if we want the modified Codespeed to be used elsewhere. Otherwise, we are good."
        },
        {
            "created_at": "2019-01-25T17:14:34.182Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4354?focusedCommentId=16752464) by Tanya Schlusser (tanya):*\nThank you for the clarifications, Wes and Areg :)!"
        },
        {
            "created_at": "2019-01-27T18:20:41.098Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4354?focusedCommentId=16753511) by Tanya Schlusser (tanya):*\nI have attached a drawing of the codespeed data model, [codespeed-data-model.png](codespeed-data-model.png).\r\n \\* Codespeed provides a data model and a web UI.\r\n \\* ASV provides a benchmark framework, a file-directory-based data model, and a static frontend.\r\n\r\nBoth have a lot in common, and both would require revision to work with the additional machine specifications (GPU; CPU cache sizes) and multiple benchmark languages we are interested in.\r\n\r\nThere is no benefit to using ASV from a web service perspective because with a database we will need either an API or a web interface, or both—either would require some front-end work; I'm ambivalent. Anyway we can think about that later.\r\n\r\nOnce we have decided on a data model and spun up the database, it may be nice to enable interaction with the database via HTTP, I am interested in exploring [postgrapgile](https://www.graphile.org/postgraphile/) for an API; it literally parses the Postgres public schema and presents it as a GraphQL interface with no additional work, and has an existing build ready for [AWS lambda](https://github.com/graphile/postgraphile-lambda-example). Then, all the data manipulation could be directly in the database. There is a `--cors` command-line option to enable use on a static site if we go that route. Codespeed also provides (I think) a JSON REST API so, again, the only question is whether we care to have a separate repo for a dynamic webpage."
        },
        {
            "created_at": "2019-01-29T05:45:34.721Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4354?focusedCommentId=16754617) by Areg Melik-Adamyan (aregm):*\nLook reasonable. Let me install TeamCity and fire up an instance for CodeSpeed. Meanwhile can you please containerize it, so it will be easy to ship and deploy?"
        },
        {
            "created_at": "2022-07-12T14:04:55.746Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4354?focusedCommentId=17565850) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}