{
    "issue": {
        "title": "[R] Build fails if dataset enabled but parquet is not",
        "body": "***Note**: This issue was originally created as [ARROW-11994](https://issues.apache.org/jira/browse/ARROW-11994). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nFollowing ARROW-11735; discovered while working on ARROW-10734. The arrow::dataset::ParquetFileFormat and related classes require both dataset and parquet. The `#if defined` logic in r/src/dataset.cpp is right and both are required, but in the wrapping that is generated for arrowExports.cpp, we only use the annotation on the functions, `[[dataset::export]]` to wrap. So the ParquetFileFormat methods in arrowExports.cpp are if defined ARROW_R_WITH_DATASET and fail if parquet is not available.\r\n\r\nNot a priority to fix (for Solaris I can turn off ARROW_DATASET and avoid this), just wanted to note it in case we need to revisit this wrapping logic later anyway. cc `[~icook]`",
        "created_at": "2021-03-16T22:23:15.000Z",
        "updated_at": "2021-03-17T00:56:50.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: R",
            "Type: bug"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2021-03-17T00:01:37.312Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-11994?focusedCommentId=17302979) by Ian Cook (icook):*\nThere was a brief discussion of this dependency of Dataset on Parquet at https://issues.apache.org/jira/browse/ARROW-11735?focusedCommentId=17291960&page=com.atlassian.jira.plugin.system.issuetabpanels%3Acomment-tabpanel#comment-17291960 but the outcome of that was simply that we allowed both Dataset and Parquet to be toggled off in the R package build. (The original scope of ARROW-11735 was solely Dataset.)\r\n\r\nOne simple solution would be to detect that Dataset is enabled and Parquet is not and fail the build with a helpful message indicating you must enable both or neither."
        },
        {
            "created_at": "2021-03-17T00:35:09.910Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-11994?focusedCommentId=17302994) by Neal Richardson (npr):*\nRight, my recollection of that discussion was different from this though. We are able to build libarrow_dataset without libparquet, that's all fine. This is just in our cpp codegen, it can't handle that as currently written (and it's probably not worth trying to make it work). \r\n\r\nYour simple solution is probably fine (and not worth the trouble right now TBH, I'll just make both of them off in the solaris build)."
        },
        {
            "created_at": "2021-03-17T00:56:28.000Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-11994?focusedCommentId=17303003) by Ian Cook (icook):*\nYep, ARROW-11735 didn't change anything in `cpp/`. IIRC it was and is possible to build libarrow with `ARROW_DATASET=ON` and `ARROW_PARQUET=OFF` but the build might fail if both are not actually installed and building that way might cause runtime errors."
        }
    ]
}