{
    "issue": {
        "title": "[Dev] Add a way for people to add information to our saved crossbow data",
        "body": "***Note**: This issue was originally created as [ARROW-13062](https://issues.apache.org/jira/browse/ARROW-13062). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nWe should have a simple + ligthweight way to annotate specific builds with information like \"won't be fixed until dask has a new release\" or \"this is supposed to be fixed in ARROW-XXX\".\r\n\r\nWe should find an easy, lightweight way to add this kind of information. \r\n\r\nOnly relevant in its previous parent: -We **should not** require, ask, or allow people to add this information to the JSON that is saved as part of ARROW-13509. That JSON should be kept pristine and not have manual edits. Instead, we should have a plain-text look up file that matches notes to specific builds (maybe to specific dates?)-",
        "created_at": "2021-06-11T17:23:11.000Z",
        "updated_at": "2022-07-14T13:48:48.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Developer Tools",
            "Type: task"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-07-12T14:04:31.430Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-13062?focusedCommentId=17565679) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        },
        {
            "created_at": "2022-07-13T15:52:48.571Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-13062?focusedCommentId=17566383) by Jonathan Keane (jonkeane):*\n`[~boshek]` Did you already add this ability? I know it's a slightly different set of tickets than the ones we actually worked, but we should either close it as duplicate, done, or won't fix (and feel free to take credit for it if you did it elsewhere as part of a larger ticket!)"
        },
        {
            "created_at": "2022-07-14T00:19:11.447Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-13062?focusedCommentId=17566564) by Sam Albers (boshek):*\nI have not added this ability. We certainly have the ability to add annotation like this though it does introduce some manual futzing unless we connected the report to this Jira board."
        },
        {
            "created_at": "2022-07-14T13:48:48.332Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-13062?focusedCommentId=17566851) by Jonathan Keane (jonkeane):*\nIMHO manual would be fine. And honestly, probably will be needed at some level since autocreating jiras will result in a bunch of jiras that overlap (in cases where multiple failures result from one change), or need to be duplicated manually when one job failure is the result of multiple changes or failures.\r\n\r\nAnyway, it's not a high priority now, we can wait until someone bumps it again — but wanted to make sure you got credit if it was already done as part of the work you pushed to get all of the other great stuff out"
        }
    ]
}