{
    "issue": {
        "title": "[C++][Dataset] Lazily parse parquet metadata / statistics in ParquetDatasetFactory and ParquetFileFragment",
        "body": "***Note**: This issue was originally created as [ARROW-10131](https://issues.apache.org/jira/browse/ARROW-10131). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nRelated to ARROW-9730, parsing of the statistics in parquet metadata is expensive, and therefore should be avoided when possible.\r\n\r\nFor example, the `ParquetDatasetFactory` (`ds.parquet_dataset()` in python) parses all statistics of all files and all columns. While when doing a filtered read, you might only need the statistics of certain files (eg if a filter on a partition field already excluded many files) and certain columns (eg only the columns on which you are actually filtering).\r\n\r\nThe current API is a bit all-or-nothing (both ParquetDatasetFactory, or a later EnsureCompleteMetadata parse all statistics, and don't allow parsing a subset, or only parsing the other (non-statistics) metadata, ...), so I think we should try to think of better abstractions.\r\n\r\ncc `[~rjzamora]` `[~bkietz]`",
        "created_at": "2020-09-29T12:32:47.000Z",
        "updated_at": "2020-10-29T20:51:55.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2020-10-29T20:51:25.000Z"
    },
    "comments": [
        {
            "created_at": "2020-09-29T13:08:11.100Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10131?focusedCommentId=17203920) by Joris Van den Bossche (jorisvandenbossche):*\nOne idea could be to not yet parse statistics in `ParquetDatasetFactory`, and to provide a columns keyword in `EnsureCompleteMetadata` (which could then be specified eg when filtering row groups to only ensure the metadata of columns involved in the filter). However, to avoid reading the metadata / footers again when doing that, we would need to store the parquet FileMetadata / RowGroupMetadata object in the fragments. \r\n\r\nSo _if_ storing the FileMetadata / RowGroupMetadata object in the fragments, we could probably go for a fully \"lazy\" access as well: `EnsureCompleteMetadata` could only ensure that the underlying parquet metadata object is stored, but the actual statistics get only parsed when actually accessing the RowGroupInfo statistics. \r\nHowever, currently the statistics are stored on the `RowGroupInfo` as a `StructScalar`, so this would also need a refactor if we want to allow accessing/parsing only the statistics of a certain column.\r\n\r\nI also don't fully know how feasable it is to actually store the FileMetadData / RowGroupMetadata on the fragment, because when eg splitting it in a fragment per row group, we would either need to copy the FileMetaData object multiple times, or the different fragments would share the same metadata.\r\n\r\n"
        },
        {
            "created_at": "2020-10-29T20:51:25.877Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10131?focusedCommentId=17223198) by Joris Van den Bossche (jorisvandenbossche):*\nIssue resolved by pull request 8507\n<https://github.com/apache/arrow/pull/8507>"
        }
    ]
}