{
    "issue": {
        "title": "[C++] If an I/O error is encountered while the dataset writer is applying backpressure there could be deadlock in rare (artifical?) situations",
        "body": "***Note**: This issue was originally created as [ARROW-16259](https://issues.apache.org/jira/browse/ARROW-16259). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nWhen I/O errors occur the dataset writer handles them when the next batch would be written (or at teardown time if it was the last batch).\r\n\r\nIf the dataset writer has applied backpressure then this doesn't work because there is no \"next batch\".\r\n\r\nThis was encountered in the python backpressure test which is a bit artificial.  To recreate this change the GatingFs::open_output_stream method to return None after its unlocked.  \r\n\r\nThis is fairly minor because it doesn't really happen in practice.  It takes many concurrent writes to get into backpressure and unless all of the fail there will be some that succeed and eventually get the writer out of backpressure enough to discover the failure.\r\n\r\nStill, it would be nice to fix this to clean things up.",
        "created_at": "2022-04-21T05:04:21.000Z",
        "updated_at": "2022-04-21T09:55:34.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-04-21T05:52:15.531Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16259?focusedCommentId=17525429) by Eduardo Ponce (edponce):*\nIs there a proposed solution for this?"
        },
        {
            "created_at": "2022-04-21T09:55:34.322Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16259?focusedCommentId=17525600) by Weston Pace (westonpace):*\nProbably the easiest thing to do is when the failure occurs the file writer should take whatever rows it has reserved from the backpressure and release them.  The only tricky part is that the failure is going to pop up from an I/O thread and so we need to make sure we're properly guarding access to the backpressure to avoid race conditions."
        }
    ]
}