{
    "issue": {
        "title": "[C++][Docs] Describe limitations and alternatives for handling dependencies via package managers",
        "body": "***Note**: This issue was originally created as [ARROW-17347](https://issues.apache.org/jira/browse/ARROW-17347). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nIn this page: <https://arrow.apache.org/docs/developers/cpp/building.html> it is described how package managers can be used to get dependencies for Arrow. My specific experience is with Apple Silicon on macOS, so I can describe my experience there. A Brewfile is provided to assist getting necessary packages to build Arrow, but it does not include all relevant packages to build the most Arrow features possible on Mac (i.e., everything but CUDA). Diving further, I learned that Homebrew cannot provide all necessary dependencies for features such as GCS support, and had to turn to conda-forge. Upon doing so, I started having overlapping dependencies elsewhere, and eventually had to turn fully to conda.\r\n\r\nIt would be helpful to have the limitations laid out for what features can be built with what package managers, as well as adding conda as an alternative to Homebrew for macOS users, since that is necessary to build the fullest Arrow possible without building other libraries from source as well.",
        "created_at": "2022-08-08T20:44:29.000Z",
        "updated_at": "2022-10-14T14:27:31.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Component: Documentation",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-08-08T22:39:14.324Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17347?focusedCommentId=17577004) by David Li (lidavidm):*\nWhat would be nice is basically: one section per package manager, an up-front warning that package managers cannot be mixed, and each section can explain its own limitations (like the GCS/Homebrew issue). I don't think we want to or can be a tutorial for every single system out there, but basic instructions would be useful, and currently that page doesn't really talk about package managers at all."
        },
        {
            "created_at": "2022-08-09T15:20:19.175Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17347?focusedCommentId=17577482) by Will Jones (willjones127):*\nWe may also wish to mention the bundled dependencies, and explain why they are generally a last resort. See also discussion: https://lists.apache.org/thread/hgory6jkqg2vcqsw36635gsqcvkgk45z"
        }
    ]
}