{
    "issue": {
        "title": "[Python] Various documentation improvements",
        "body": "***Note**: This issue was originally created as [ARROW-2684](https://issues.apache.org/jira/browse/ARROW-2684). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe python documentation is currently not beginner friendly and things like the IPC format are not discoverable. For example, <https://arrow.apache.org/docs/python/ipc.html> has the word \"IPC\" only in the title. Also, it's currently not clear how to write a file to disk.\r\n\r\nI propose that the documentation becomes more of an API docs rather than a set of examples. Examples are valuable but they cannot replace documentation of the inputs and outputs of various functions. \r\n\r\nSee <https://github.com/apache/arrow/issues/2119> for more. ",
        "created_at": "2018-06-08T19:20:28.000Z",
        "updated_at": "2019-01-09T16:53:32.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2019-01-09T16:53:32.000Z"
    },
    "comments": [
        {
            "created_at": "2018-06-08T19:41:12.705Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2684?focusedCommentId=16506494) by Wes McKinney (wesm):*\nThe scope of this issue is very broad. Could you narrow this down to something specific and actionable, or create multiple issues for things you wish to see improved?"
        },
        {
            "created_at": "2018-06-08T20:13:45.492Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2684?focusedCommentId=16506519) by Dominik Moritz (domoritz):*\nHere are some concrete suggestions\r\n\r\n \r\n \\* Instead of using ipython with noise (`In [9]:`), write small, reusable, code snippets\r\n \\* Describe what the different kinds of NativeFile mean and when to use them. The description of Buffer (arrow::Buffer can be zero-copy sliced to permit Buffers to cheaply reference other Buffers, while preserving memory lifetime and clean parent-child relationships) is a bit cryptic to beginners. \r\n \\* Describe concrete use cases like: taking a pandas data frame and write a file to disk, load an arrow file from disk to a pandas data frame, and read and write to a memory mapped files to exchange data between applications. \r\n \\* Overall, the examples are not practical because for example in <https://arrow.apache.org/docs/python/ipc.html#writing-and-reading-random-access-files> it is not clear what to do with the sink (the BufferOutputStream). \r\n \\* Remove the feather documentation if that is not the preferred way to write files anymore. \r\n \\* Why do we write the same batch 5 time? `for i in range(5):  ...:  writer.write_batch(batch)`\r\n\r\nI don't know how to break this up into multiple issues because I'm not familiar enough with arrow (started using it yesterday) but I hope that these are helpful suggestions. "
        },
        {
            "created_at": "2018-06-11T19:55:30.982Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2684?focusedCommentId=16508643) by Wes McKinney (wesm):*\nMany of these criticisms are subjective – I have learned over the years that I have a different approach to programming pedagogy than some other people do. I prefer to teach principles and concepts rather than starting from applications / concrete use cases and working backwards. I don't think statements like \"the examples are not practical\" are constructive. \r\n\r\nIMHO, the documentation should have both principles and discussion of low-level concepts as well as more \"cookbook\" type of \"get up and go\" examples. Because there is not a cookbook in the documentation does not mean that the other documentation is bad. \r\n\r\nI think we can create a number of JIRAs based on this feedback about adding more documentation sections to address some of the common use cases to help new users get up and running. We are all volunteers, so it may be a while until someone else gets around to writing such documentation. We would definitely welcome your assistance. "
        },
        {
            "created_at": "2019-01-09T12:32:53.325Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2684?focusedCommentId=16738174) by Antoine Pitrou (apitrou):*\nNote that the Python documentation has been improved recently. You'll find a recent devlopment build [here](https://pitrou.net/arrowdevdoc/python/index.html)."
        }
    ]
}