{
    "issue": {
        "title": "[R][Doc] minor error in Linux installation documentation ('conda' option) for R on CRAN",
        "body": "***Note**: This issue was originally created as [ARROW-17224](https://issues.apache.org/jira/browse/ARROW-17224). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe documentation for the Linux installation for the r-arrow binary for R is at:\r\n\r\n    https://cran.r-project.org/web/packages/arrow/vignettes/install.html\r\n\r\nThe documentation indicates that the 'conda' installation syntax should be:\r\n\r\n``\r\n```java\n\r\nconda install -c conda-forge --strict-channel-priority r-arrow\n```\r\n``\r\n\r\nI can't get that to work.  What works for me is:\r\n```java\n\r\nconda config --set channel_priority strict\r\nconda install -c conda-forge r-arrow\n```\r\nI'm wondering if the syntax presented in the documentation is either deprecated or incorrect.",
        "created_at": "2022-07-27T03:56:20.000Z",
        "updated_at": "2022-10-20T04:40:00.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Documentation",
            "Component: R",
            "Type: bug"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-07-29T18:25:33.767Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17224?focusedCommentId=17573105) by Jacob Wujciak-Jens (assignUser):*\nHello thanks for the ticket. I have replicated this on ubuntu 20.04 and while it does solve the environment at some point it takes a very long time (>1h), which is of course not acceptable. I don't know why this happens but will look into it, even if there is a fix we probably want to update the docs..."
        },
        {
            "created_at": "2022-07-29T18:36:00.680Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17224?focusedCommentId=17573108) by Wayne Smith (wwsmith):*\nJacob, I concur.  And doing conda -y update conda base (or similar) beforehand (as suggested quite often on StackOverflow) doesn't help (and also takes a long time).\r\n\r\nThe first suggestion for installing r-arrow on Linux from the docs–i.e., upgrading directly from Rstudio (now Posit) is the fastest and works.  I just don't hope the link to the binaries is brittle or unreliable (you might want to check that too).\r\n\r\nI've also gotten it to work with the 'nightly' version hosted on Apache.  The compilation is much slower than the RStudio instructions (again, now Posit) approach and also needs (as the doc's say) the libcurl4-openssl-dev package.  However, my experience is that some (non-sudo) users can't install that package on their distro.\r\n\r\nOne more issue.  The Rstudio package pull is actually for Ubuntu 18.04, not Ubuntu 20.04 (or even 22.04).  It's not clear to me that is a bug or a feature over the long run.  And it should be documented by Rstudio.  Even it is, we might consider documenting that subtle change in the Arrow/Linux/R doc's too (just my $.02.)\r\n\r\nBest,\r\n\r\nWayne\r\n\r\n "
        },
        {
            "created_at": "2022-07-29T19:14:32.340Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17224?focusedCommentId=17573131) by Jacob Wujciak-Jens (assignUser):*\n> I just don't hope the link to the binaries is brittle or unreliable (you might want to check that too)\r\n\r\nWhich link do you mean the RSPM link? (\"https://packagemanager.rstudio.com/all/__linux__/focal/latest\")? This is will always give you the newest version. If you want to pin a certain version you can check the RSPM docs on how to create a time stamped link. (But I would probably rather use [renv](https://rstudio.github.io/renv/index.html) or [conda-lock](https://anaconda.org/conda-forge/conda-lock) if you require a reproducible environment.)\r\n\r\n> I've also gotten it to work with the 'nightly' version hosted on Apache.  The compilation is much slower than the RStudio instructions\r\n\r\nYes while we have pre-compiled libarrow binaries and a script that detects which one matches you distro best, we still need to compile the actual R package which takes ~5 minutes. While RSPM (PPM soon :D) supplies package binaries that don't require any compilation. An important note in regards to the nightlies: these are 100% brittle as we only ever keep 14 versions/days around and delete everything else. So if you require reproducibility I would advise against using them.\r\n\r\nI have talked to some conda-forge users and they all recommend using [mamba](https://github.com/mamba-org/mamba) when using conda-forge packages as it has a much faster solver. Something that might need to be added to the docs."
        }
    ]
}