{
    "issue": {
        "title": "[R] Create a  CRAN-specific packaging checklist that lives in the R package directory",
        "body": "***Note**: This issue was originally created as [ARROW-18345](https://issues.apache.org/jira/browse/ARROW-18345). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nLike other packaging tasks, the CRAN packaging task (which is concerned with making sure the R package from the Arrow release complies with CRAN policies) for the R package is slightly different than the overall Arrow release task for the R package. For example, we often push patch-patch releases if the two-week window we get to \"safely retain the package on CRAN\" does not line up with a release vote. `[~npr]` has heroically been doing this for a long time, and while he has equally heroically volunteered to keep doing it, I am hoping to process of codifying this somewhere in the R repo will help a wider set of contributors understand the process (even if it was already documented elsewhere!).\r\n\r\n`[~stephhazlitt]` and I use `usethis::use_release_issue()` to manage our personal R package releases, and I'm wondering if creating a similar function or markdown template would help here.\r\n\r\nI'm happy to start the process of putting a PR up for discussion!",
        "created_at": "2022-11-16T15:01:55.000Z",
        "updated_at": "2022-11-18T20:31:41.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: R",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-11-16T15:12:55.817Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-18345?focusedCommentId=17634879) by Neal Richardson (npr):*\nI've been keeping https://cwiki.apache.org/confluence/display/ARROW/Release+Management+Guide#ReleaseManagementGuide-UpdatingRpackages up to date. The only thing not mentioned there is that I generally make a branch on my fork off of the release tag (`apache-arrow-x.y.z`) where I add/cherry-pick any extra commits we need for the CRAN release. Sometimes this is just deleting the line in the README with the badges to avoid spurious URL check failures.\r\n\r\nThe other thing not mentioned there, now that I look at it, is doing reverse dependency checks."
        }
    ]
}