{
    "issue": {
        "title": "Dockerize verify-release-candidate.{sh,bat}",
        "body": "***Note**: This issue was originally created as [ARROW-2959](https://issues.apache.org/jira/browse/ARROW-2959). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThere are a number of issues with the linux version of this script that would disappear if the commands were all being run in a docker container.\r\n\r\nAnyone with docker installed should be able to verify the release candidate\r\n\r\nWe could probably do the same for windows as well.",
        "created_at": "2018-08-01T15:17:05.000Z",
        "updated_at": "2019-01-18T16:03:37.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Component: Packaging",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2019-01-18T16:03:37.000Z"
    },
    "comments": [
        {
            "created_at": "2018-08-01T15:19:51.727Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565473) by Phillip Cloud (cpcloud):*\nVerifying the release candidate should be as simple as\r\n\r\n```Java\n\r\ndocker pull apache/arrow-verify-release:latest\r\ndocker run apache/arrow-verify-release ./verify.sh\r\n```"
        },
        {
            "created_at": "2018-08-01T15:20:51.826Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565477) by Phillip Cloud (cpcloud):*\nObviously we might not be able to use that exact repo, but the idea remains the same"
        },
        {
            "created_at": "2018-08-01T15:29:46.484Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565489) by Wes McKinney (wesm):*\nThe downside of this is that running in a Docker container will cause us to miss failures that are the result of issues on different platforms. Users may build and deploy Arrow in many different places"
        },
        {
            "created_at": "2018-08-01T15:30:27.202Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565491) by Wes McKinney (wesm):*\nAs an example, I'm in the midst of trying to debug a failure on Xcode 6.4 while I'm using Ubuntu 14.04 and having no issues here https://github.com/apache/parquet-cpp/pull/467"
        },
        {
            "created_at": "2018-08-01T15:44:06.971Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565512) by Phillip Cloud (cpcloud):*\nI don't think that it's reasonable to expect contributors to maintain a cross platform shell script that cannot be guaranteed to be run from a single common point of origin.\r\n\r\nFor example, the script doesn't work if you're inside of a non-base conda environment that has ARROW_HOME set to CONDA_PREFIX.\r\n\r\nI should be able to verify the release for common platforms without having to think about what environment variables I have set or what state my shell is in.\r\n\r\nYes, arrow is built and deployed in a number of places but AFAICT most people who run the release verification script are working on Ubuntu or OS X so we're not catching anything (or people are running it and running into bugs and not reporting it) now that we would not catch by moving to docker for this."
        },
        {
            "created_at": "2018-08-01T15:46:12.099Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565515) by Phillip Cloud (cpcloud):*\nAlso, docker exists for Linux, OS X, and Windows, so I'm not sure what platforms we'd really be missing."
        },
        {
            "created_at": "2018-08-01T15:56:12.746Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565533) by Wes McKinney (wesm):*\nI agree with you, but we should strive to make the script run on as many platforms as possible. It's good information to know whether there is a problem that is not found in the Linux distro used in the Dockerfile. \r\n\r\nThe script is intended to run in an environment that has not been polluted by any _HOME variables or anything else relating to Arrow development, ie simulating the experience of an average non-developer consumer. "
        },
        {
            "created_at": "2018-08-01T16:25:40.783Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565580) by Uwe Korn (uwe):*\nI run this script on several different systems on the vote to see if there are any problems. Only running it in docker gives us the falsehood to believe it will run everywhere. But running the script only in docker will simply result in users reporting the same problems after the release as issues."
        },
        {
            "created_at": "2018-08-01T17:09:59.937Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565646) by Phillip Cloud (cpcloud):*\nUnless we're actually testing this, the expectation to keep the script cross platform without making it known what systems this needs to run on _and_ without providing a way for people to easily test across these platforms is unreasonable IMO.\r\n\r\nJust to be clear, I personally am not going to invest time in bending over backwards to keep the script cross-undocumented-system compatible. I'm not going to stress out about keeping it that way for systems whose setup I have no way to reproduce.\r\n\r\nI wasted a lot of time today only to figure out that the verification script can fail with a segfault when you are in a conda environment and have `ARROW_HOME` set. I don't think documenting this solves the problem, though it would have solved my immediate problem.\r\n\r\nWhat is reasonable to me and what I think would solve the problem, is to provide a reliable way to set up each system we expect to be able to run on so that anyone can verify all supported platforms with minimal hassle.\r\n\r\nIs there an alternative to docker for solving this problem in a way that is acceptable to everyone?"
        },
        {
            "created_at": "2018-08-01T17:22:31.495Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16565663) by Wes McKinney (wesm):*\n> Unless we're actually testing this\r\n\r\nI think we should, in a nightly build\r\n\r\n> Just to be clear, I personally am not going to invest time in bending over backwards to keep the script cross-undocumented-system compatible. I'm not going to stress out about keeping it that way for systems whose setup I have no way to reproduce.\r\n\r\nOther developers will be responsible for reporting problems and helping fix them. This is a shared responsibility and part of making sure Arrow runs in a lot of places.\r\n\r\n> I wasted a lot of time today only to figure out that the verification script can fail with a segfault when you are in a conda environment and have ARROW_HOME set. I don't think documenting this solves the problem, though it would have solved my immediate problem.\r\n\r\nI wanted someone other than Uwe or me to suffer a bit as a release manager so that more problems like these can be better documented and fixed. So what needs to be said to prevent this particular issue is: \"run this script in a clean, unadulterated environment\" (I know this from my past experience as an RM but I didn't write this down)\r\n\r\n> What is reasonable to me and what I think would solve the problem, is to provide a reliable way to set up each system we expect to be able to run on so that anyone can verify all supported platforms with minimal hassle.\r\n\r\nThere's way too many possibilities. The best we can do is test the primary platforms (Ubuntu LTS releases, CentOS 6/7, Xcode 6.4 and higher, Windows MSVC 2015) and hope to catch more problems from users verifying the release on other platforms. For example, running these platforms would not have caught the Arch Linux issue that you reported from bleeding edge gcc. \r\n\r\nReally all we are doing is cutting down on build/deploy problems that may occur after a release is cut.\r\n\r\nDocker would help with automated testing a release candidate on the common platforms (Ubuntu, CentOS/RedHat/Fedora, Arch) but we still need to rely on others to verify the release on their platform and report problems."
        },
        {
            "created_at": "2018-10-19T19:11:57.423Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16657298) by Krisztian Szucs (kszucs):*\nWe can do this in a similar fashion like https://github.com/apache/arrow/pull/2755\r\n"
        },
        {
            "created_at": "2018-10-19T22:01:49.934Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16657498) by Wes McKinney (wesm):*\nWe still need to run the release verification in user environments, to make sure we haven't missed something that appears in a distribution-specific way. Finding a problem won't necessary invalidate a release, but it would be better to know than not know"
        },
        {
            "created_at": "2019-01-18T16:03:37.556Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2959?focusedCommentId=16746433) by Wes McKinney (wesm):*\nClosing as Won't Fix. The release verification process is regularly turning up issues that would be occluded by a Dockerized build (e.g. I found several problems on Ubuntu 14.04 for 0.12)\r\n\r\nI think we should definitely make it more straightforward / simpler to set up the user environment to run the script though"
        }
    ]
}