{
    "issue": {
        "title": "[Packaging] Add unit tests for crossbow",
        "body": "***Note**: This issue was originally created as [ARROW-2858](https://issues.apache.org/jira/browse/ARROW-2858). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nAs this code grows we should start adding unit tests to make sure we can make changes safely.",
        "created_at": "2018-07-16T22:36:11.000Z",
        "updated_at": "2022-07-12T14:04:53.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Packaging",
            "Type: task"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2018-07-16T23:28:20.043Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2858?focusedCommentId=16545866) by Wes McKinney (wesm):*\n+1. Probably will want to make some mock fixtures for all the various things"
        },
        {
            "created_at": "2018-11-22T20:27:31.018Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2858?focusedCommentId=16696248) by Wes McKinney (wesm):*\nMoving to 0.13. `[~kszucs]` how do you want to proceed on this?"
        },
        {
            "created_at": "2018-11-23T12:20:59.053Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2858?focusedCommentId=16697065) by Krisztian Szucs (kszucs):*\nManipulating the git repo via pygit2 is easily testable, pushing and pulling can be difficult.\r\nMocking the Github API for artifact uploading downloading and CI status updates is more difficult, but We can either use a requests mocking library like responses, or reuse github3py's testing suite: https://github.com/sigmavirus24/github3.py/tree/master/tests/cassettes\r\n\r\nOf course it depends on how do We want to move forward with the build system, if We choose to utilize either jenkins or buildbot this issue will become obsolete."
        },
        {
            "created_at": "2018-11-23T14:19:25.536Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2858?focusedCommentId=16697192) by Wes McKinney (wesm):*\nI think it'd be OK to try to mock as much of the network-depending code as possible. The goal really is to test that the business logic works\r\n\r\n> Of course it depends on how do We want to move forward with the build system\r\n\r\nI think there's value in being able to run jobs on public CI systems, the approach used for build orchestration and management need not conflict with that. The only thing we cannot do is nothing =) The lack of a more scalable testing and monitoring solution is becoming a drag on the project, so we need to discuss on the mailing list and come up with a plan. \r\n\r\nThere are some things we just can't do in public CI services. Example: testing on GPUs. Because we can't run certain tests on public CIs doesn't mean that public CIs are useless. We have to get creative with our approach\r\n\r\n"
        },
        {
            "created_at": "2022-07-12T14:04:53.493Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2858?focusedCommentId=17565822) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}