{
    "issue": {
        "title": "[C++] Substarit End-To-End Tests for Relations",
        "body": "***Note**: This issue was originally created as [ARROW-17457](https://issues.apache.org/jira/browse/ARROW-17457). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nAt the moment the test coverage for Substrait integration covers the functional tests for serializing and deserializing. But it lacks test for running end-to-end functional tests which proves whether a Substrait plan can deliver the expected outcome. As a part of this, for each relation (Read, Filter, Project, Join, Aggregate) must have end-to-end tests covering the options associated with each relation. ",
        "created_at": "2022-08-18T03:08:25.000Z",
        "updated_at": "2022-11-18T17:51:46.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-08-19T13:20:09.360Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17457?focusedCommentId=17581854) by Weston Pace (westonpace):*\nIt is a bit spread out but we have some end-to-end tests on some of these features.  There are a few different round trip tests (and your examples) which test the read relation.  The tests in `arrow/engine/substrait/function_test.cc` do round trip testing for Project and Aggregate.  We do not have any round trip tests that I know of for Filter or Join."
        },
        {
            "created_at": "2022-08-20T02:58:07.537Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17457?focusedCommentId=17582108) by Vibhatha Lakmal Abeykoon (vibhatha):*\nSo it would be better to improve the `function_test.cc` interface for this. \r\n\r\nI also have something in mind with a write-up on developer's perspective. May be include some of the choices we have made. I also find that, having more Python tests could cover a lot of ground in terms of various functional tests. Python tests would be roubust and easy to adopt for high level end-to-end test cases."
        },
        {
            "created_at": "2022-11-18T17:51:46.749Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17457?focusedCommentId=17635971) by Apache Arrow JIRA Bot (arrowjira):*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned per [project policy](https://arrow.apache.org/docs/dev/developers/bug_reports.html#issue-assignment). Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}