{
    "issue": {
        "title": "[R][Doc] Reorganize and improve README and vignette content",
        "body": "***Note**: This issue was originally created as [ARROW-11477](https://issues.apache.org/jira/browse/ARROW-11477). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nCollecting various ideas here for general ways to improve the R package README and vignettes for the 4.0.0 release:\r\n \\* Consider moving the \"building\" and \"developing\" content out of the REAMDE and into a vignette focused on that topic. (Rationale: most users of the R package today are downloading prebuilt binaries, not building their own; most users today are end users, not developers; a more valuable use for the README—especially since that it's the homepage of the R docs site—would be as a place to highlight key capabilities of the package, not to show folks all the technical details of building it.)\r\n \\* Get the \"Using the Arrow C++ Library in R\" vignette to show in the Articles menu on the R docs site.\r\n \\* Edit the \"Working with Arrow Datasets and dplyr\" vignette to make clear that dplyr verbs can be used with Arrow Tables and RecordBatches (not just Datasets) and describe differences in dplyr support for these different Arrow objects.\r\n \\* Check all the links in the \"Project docs\" menu on the docs site; some of them are currently broken or go to directory listings",
        "created_at": "2021-02-02T22:37:55.000Z",
        "updated_at": "2021-04-14T23:42:41.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Documentation",
            "Component: R",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2021-04-14T23:42:27.000Z"
    },
    "comments": [
        {
            "created_at": "2021-02-02T22:42:59.313Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-11477?focusedCommentId=17277511) by Neal Richardson (npr):*\nRe the \"Using the Arrow C++ Library in R\" vignette, it is (or at least used to be) pkgdown's convention that `vignette(\"pkgname\")` gets put as the \"Get started\" link in the top menu bar, and all other vignettes go under Articles. But we have the ability to override that. "
        },
        {
            "created_at": "2021-03-11T19:17:15.831Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-11477?focusedCommentId=17299820) by Ian Cook (icook):*\nConsider extracting out the README and dplyr piece of this for the 4.0.0 release and deferring the remainder for a later release."
        },
        {
            "created_at": "2021-04-14T23:42:27.840Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-11477?focusedCommentId=17321807) by Neal Richardson (npr):*\nIssue resolved by pull request 10014\n<https://github.com/apache/arrow/pull/10014>"
        }
    ]
}