{
    "issue": {
        "title": "[Docs] Incorrect contact email in Github",
        "body": "***Note**: This issue was originally created as [ARROW-13698](https://issues.apache.org/jira/browse/ARROW-13698). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nGithub repository for arrow suggest to contact <user@arrow.apache.org> to ask questions.\r\n\r\nChoice 1 in <https://github.com/apache/arrow/issues/new/choose>\r\n\r\nWhen doing so at the time of this writing, it returns an email error:\r\n```\n\r\nHi. This is the qmail-send program at apache.org.\r\n\r\nI'm afraid I wasn't able to deliver your message to the following addresses.\r\n\r\nThis is a permanent error; I've given up. Sorry it didn't work out.\r\n\r\n\r\n\r\n<user@arrow.apache.org>:\r\n\r\nMust be sent from an @apache.org address or a subscriber address or an address in LDAP. \n```",
        "created_at": "2021-08-23T15:36:12.000Z",
        "updated_at": "2021-08-24T07:25:29.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Documentation",
            "Type: bug"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2021-08-23T18:54:09.173Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-13698?focusedCommentId=17403340) by Weston Pace (westonpace):*\nYou will need to subscribe to the user@ mailing list (by sending an email with any subject and no body to user-subscribe@arrow.apache.org) in order to be able to send questions there.\r\n\r\nThat being said, I can understand how the text may have been a bit misleading.  It was intended to discourage using Github Issues for asking questions as those are not as regularly monitored by as many people and so you aren't likely to get as fast and complete of a response.\r\n\r\nIt is not complete on its own however as it doesn't explain how to subscribe."
        },
        {
            "created_at": "2021-08-24T07:24:53.146Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-13698?focusedCommentId=17403601) by Olivier Peyrusse (opeyrusse):*\nYes, and that is exactly what I understood and why I tried first to send an email.\r\n\r\nI also clicked on the Github button and start reading the predefined text in the issue that started as:\r\n```\n\r\nSTOP! Are you reporting a bug, a possible bug, or requesting a\r\nfeature? If so, please report under the ARROW project on the ASF JIRA\r\nserver https://issues.apache.org/jira/browse/ARROW...\n```\r\nSo I stopped with this form and tried sending the mail.\r\n\r\nNow that I completely read it, I see at the end that it says that one must subscribe to the user list before sending at mail, given the address you provided.\r\n\r\nOne option would be to move that text first template and possibly update the Github headline for this to emphasize that details are provided in the issue template.\r\n\r\nFeel free to close this ticket any time you want. It was mostly to give the feedback of my email attempt. Now you know.\r\nIf you want my opinion, keep it open and I will answer.\r\n\r\nHave a nice day."
        }
    ]
}