{
    "issue": {
        "title": "[R] Discussion: move testthat test helpers to R/test-helpers.R",
        "body": "***Note**: This issue was originally created as [ARROW-15301](https://issues.apache.org/jira/browse/ARROW-15301). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nWould it make sense to have all custom expectations in `R/` , maybe `R/test-helpers.R` ? Reasons: \r\n \r\n \\* edit(added on 12/01/2022): probably the most important point is these files are source by `devtools::load_all()` and, thus, helper functions are available interactively. \r\n \\* easier for newbies to read a file and figure out what custom testthat helpers we have\r\n \\* easier to document\r\n \\* respects the testthat author's suggestion to have them there\r\n\r\nCurrently we have 17 different custom expectations, all defined in different files.\r\nA follow-up thought: maybe move all helpers there (`{}is.{`}, `{}as_{`}, `{}compare_{`}, `verify` etc).",
        "created_at": "2022-01-11T14:29:06.000Z",
        "updated_at": "2022-05-04T12:15:52.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: R",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2022-05-04T12:15:52.000Z"
    },
    "comments": [
        {
            "created_at": "2022-01-11T15:34:48.883Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15301?focusedCommentId=17472832) by Nicola Crane (thisisnic):*\nI don't find them too bad, but given I wrote a load of extra documentation for some of the functions as I just couldn't understand the whole lot in the first place, I'm probably not the best person to ask here ;)  \r\n\r\nOne thing I'll say is that I don't think there's necessarily a need to know about all the custom expectations until you need to use them, and can do so by analogy; I'm a committer and have written a fair few bindings but am unaware of at least half of those custom expectations as I've never needed them.\r\n\r\nAll that said, **if** there's no negative consequences of doing so, I don't see the harm in reorganising things here though, and am in favour of things that'll make life easier for new contributors regardless."
        },
        {
            "created_at": "2022-01-11T15:59:39.496Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15301?focusedCommentId=17472851) by Dragoș Moldovan-Grünfeld (dragosmg):*\nI think having all custom helpers / functionality in one place would make it easier to say: \"All custom functionality lives in this file\"."
        },
        {
            "created_at": "2022-01-11T19:41:08.689Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15301?focusedCommentId=17473124) by Dewey Dunnington (paleolimbot):*\nThank you for raising this issue...I found this particularly difficult about the arrow R package tests, particularly when I first started working on them, although it also comes up whenever I have to debug a new test failure (because for most tests in arrow, you have to step through the whole file, as you noted).\r\n\r\nIf this is something that contributors are keen on, it may be worth considering a \"you touch it, you fix it\" approach (as opposed to a reorganization). Or maybe...new tests should be self-contained to the greatest extent possible? Those approaches wouldn't require new work and we might realize as we're writing new tests that we really do need the helpers. Just a few thoughts!\r\n"
        },
        {
            "created_at": "2022-01-12T13:48:13.649Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15301?focusedCommentId=17474541) by Dragoș Moldovan-Grünfeld (dragosmg):*\nI wouldn't regard moving all `testthat` helpers to `test-helpers.R` or some file that ends with _helpers_ as a full-on reorganisation.\r\n\r\nWhy a file ending in {_}helpers{_}? Because `devtools::load_all()` sources (via `pkgload:::testthat_source_test_helpers()` all files ending in _helpers_ and, thus, any functions defined there are available interactively. In the current scenario if a developer needs to run a test block containing an \\{arrow}-specific helper function, they need to find where the helper is defined (source that file or run the lines) and then run the test block. I think this workflow adds quite a bit of friction.\r\n"
        },
        {
            "created_at": "2022-01-13T15:19:09.476Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15301?focusedCommentId=17475445) by Nicola Crane (thisisnic):*\nActually, on the basis of the fact that `devtools::load_all()` would load them, I now think this is a great idea to move them into the R directory; I've had multiple moments when testing that I've had to manually go load them and it'd be nice to not have to do that."
        },
        {
            "created_at": "2022-01-17T10:16:35.546Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15301?focusedCommentId=17477096) by Dragoș Moldovan-Grünfeld (dragosmg):*\nMy understanding of loading helpers was incorrect. I think `pkgload::testthat_source_test_helpers()` sources all files that start with the word `helper` from the test directory (`tests/testthat`).\r\n\r\nIt turns out this is less of a problem that I initially thought. I still think it would be a good idea to move a bit more towards the canonical structure of the testing folders and helpers. "
        },
        {
            "created_at": "2022-01-17T19:46:44.162Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15301?focusedCommentId=17477382) by Dewey Dunnington (paleolimbot):*\nMaybe an intermediary solution is to mention it in our developer docs? We already recommend `devtools::load_all()`, maybe just a sentence about why?\r\n\r\nhttps://arrow.apache.org/docs/r/articles/developing.html#loading-arrow"
        }
    ]
}