{
    "issue": {
        "title": "[Python][Parquet] Use pypi condition package to filter partitions in a user friendly way",
        "body": "***Note**: This issue was originally created as [ARROW-11566](https://issues.apache.org/jira/browse/ARROW-11566). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nI created the pypi condition package to allow user friendly expression of conditions. For example, a condition can be written as:\r\n\r\n(f.A <= 3 or f.B != 'b1') and f.C == ['c1', 'c2'] \r\n\r\nwhere A, B, C are partition keys.\r\n\r\nFor usage details, please see its document at: \r\n\r\n[https://condition.readthedocs.io/en/latest/usage.html](https://condition.readthedocs.io/en/latest/usage.html#)\r\n\r\n \r\n\r\nArbitrary condition objects can be converted to pyarrow's filter by calling its\r\n\r\nto_pyarrow_filter() method:\r\n\r\n<https://condition.readthedocs.io/en/latest/usage.html#pyarrow-partition-filtering>\r\n\r\nThe above method will normalize the condition to conform to pyarrow filter specification.\r\n\r\n \r\n\r\nFurthermore, the condition object be directly used to evaluate partition paths. This can replace the current complex filtering codes. (both native and python)\r\n\r\nFor max efficiency, filtering with the condition object can be done in the below ways:\r\n1. read the paths in chunks to keep the memory footprint small;\n1. parse the paths to be a pandas dataframe;\n1. use condition.query(dataframe) to get the filtered dataframe of path.\n1. use numexpr backend for dataframe query for efficiency.\n   \n   Please discuss.",
        "created_at": "2021-02-09T03:37:30.000Z",
        "updated_at": "2022-07-12T14:04:45.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-07-12T14:04:45.114Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-11566?focusedCommentId=17565728) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}