{
    "issue": {
        "title": "[C++] Remove default exec context from Expression::Bind",
        "body": "***Note**: This issue was originally created as [ARROW-16811](https://issues.apache.org/jira/browse/ARROW-16811). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThis came up in https://github.com/apache/arrow/pull/13355.\r\n\r\nIt is maybe not very intuitive that Expression::Bind would require an ExecContext and so we never provided one.  However, when binding expressions we need to lookup kernels, and that requires a function registry.  Defaulting to default_exec_context is something that should be done at a higher level and so we should not allow ExecContext to be omitted when calling Bind.\r\n\r\nFurthermore, `[~rtpsw]` has suggested that we might want to split Expression::Bind into two variants.  One which requires an ExecContext and one which does not (but fails if it encounters a \"call\").",
        "created_at": "2022-06-10T20:45:51.000Z",
        "updated_at": "2022-11-07T06:49:25.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-06-10T20:51:17.158Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16811?focusedCommentId=17552965) by Weston Pace (westonpace):*\n`[~rtpsw]` Where would you see the \"bind but don't support functions\" variant being useful?  I suppose I'm not quite sure I understand the intent."
        },
        {
            "created_at": "2022-06-10T22:44:30.796Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16811?focusedCommentId=17552993) by Yaron Gvili (rtpsw):*\nYou are referring to [this post](https://issues.apache.org/jira/browse/ARROW-16796?focusedCommentId=17552569&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-17552569). This limited-bind is not ideal, though it can be useful as an intermediate solution in places in the code that cannot be easily changed to a work with a non-default ExecContext. I imagine this could be the case in some user-facing APIs that currently do not take an ExecContext, and eventually defaults to the global function registry (perhaps examples exist in the dataset package?). In such cases, there are two options to consider: either break user code to force it to provide an ExecContext, or keep user-code intact but fail on runtime when an expression gets bound in a non-safe way. The latter one is what I wanted to draw attention to."
        },
        {
            "created_at": "2022-10-10T17:51:25.780Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16811?focusedCommentId=17615240) by Apache Arrow JIRA Bot (arrowjira):*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned per [project policy](https://arrow.apache.org/docs/dev/developers/bug_reports.html#issue-assignment). Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}