{
    "issue": {
        "title": "[Python] [Dataset] Add partition_filename_cb to ds.write_dataset()",
        "body": "***Note**: This issue was originally created as [ARROW-12365](https://issues.apache.org/jira/browse/ARROW-12365). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nI need to use the legacy pq.write_to_dataset() in order to guarantee that a file within a partition will have a specific name. \r\n\r\nMy use case is that I need to report on the final version of data and our visualization tool connects directly to our parquet files on Azure Blob (Power BI).\r\n\r\n1) Download data every hour based on an updated_at timestamp (this data is partitioned by date)\r\n\r\n2) Transform the data which was just downloaded and save it into a \"staging\" dataset (this has all versions of the data and there will be many files within each partition. In this case, up to 24 files within a single date partition since we download hourly)\r\n\r\n3) Filter the transformed data and read a subset of columns, sort it by the updated_at timestamp and drop duplicates on the unique constraint, then partition and save it with partition_filename_cb. In the example below, if I partition by the \"date_id\" column, then my dataset structure will be \"/date_id=202104123/20210413.parquet\"\r\n```java\n\r\n        use_legacy_dataset=True,         partition_filename_cb=lambda x: str(x[-1]) + \".parquet\",\n```\r\nUltimately, I am sure that this final dataset has exactly one file per partition and that I only have the latest version of each row based on the maximum updated_at timestamp. My visualization tool can safely connect to and incrementally refresh from this dataset.\r\n\r\n \r\n\r\n \r\n\r\nAn alternative solution would be to allow us to overwrite anything in an existing partition. I do not care about the file names so much as I want to ensure that I am fully replacing any data which might already exist in my partition, and I want to limit the number of physical files.\r\n\r\n ",
        "created_at": "2021-04-13T13:58:35.000Z",
        "updated_at": "2022-03-04T13:17:49.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2022-03-04T13:17:49.000Z"
    },
    "comments": [
        {
            "created_at": "2021-04-29T09:30:24.791Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-12365?focusedCommentId=17335292) by Lance Dacey (ldacey):*\n@jorisvandenbossche I will close this issue in favor of an overwrite option for partitions since that is the only reason I use the partition_filename_cb\r\n\r\nhttps://issues.apache.org/jira/browse/ARROW-12358"
        },
        {
            "created_at": "2021-08-23T23:19:58.015Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-12365?focusedCommentId=17403428) by Weston Pace (westonpace):*\n`[~jorisvandenbossche]` Can we close this issue as resolved by ARROW-12364 or am I missing something?"
        },
        {
            "created_at": "2021-08-24T11:55:34.609Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-12365?focusedCommentId=17403767) by Lance Dacey (ldacey):*\nThe metadata collector works great, but this issue is more related to https://issues.apache.org/jira/browse/ARROW-12358\r\n\r\nI use the partition_filename_cb to guaranteed that I overwrite partitions which I do not think we can control with ds.write_dataset() because of the \\{i} counter which may be different and accidentally write a new file into an existing partition (I need to be sure that there are no duplicates in the data, since our Power BI tool connects directly to the parquet dataset)"
        },
        {
            "created_at": "2022-03-04T13:17:49.447Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-12365?focusedCommentId=17501320) by Lance Dacey (ldacey):*\ndelete_matching option solves this issue"
        }
    ]
}