{
    "issue": {
        "title": "[Java/Python] in-process vector sharing from Java to Python",
        "body": "***Note**: This issue was originally created as [ARROW-2249](https://issues.apache.org/jira/browse/ARROW-2249). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nCurrently we seem to use in all applications of Arrow the IPC capabilities to move data between a Java process and a Python process. While this is 0-serialization, it is not zero-copy. By taking the address and offset, we can already create Python buffers from Java buffers: https://github.com/apache/arrow/pull/1693. This is still a very low-level interface and we should provide the user with:\r\n\r\n- A guide on how to load Apache Arrow java libraries in Python (either through a fat-jar that was shipped with Arrow or how he should integrate it into its Java packaging)\n- `pyarrow.Array.from_jvm`, `pyarrow.RecordBatch.from_jvm`, … functions that take the respective Java objects and emit Python objects. These Python objects should also ensure that the underlying memory regions are kept alive as long as the Python objects exist.\n  \n  This issue can also be used as a tracker for the various sub-tasks that will need to be done to complete this rather large milestone.",
        "created_at": "2018-03-03T17:08:46.000Z",
        "updated_at": "2022-07-12T14:04:16.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Java",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2018-11-14T22:04:40.251Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2249?focusedCommentId=16687195) by Wes McKinney (wesm):*\n`[~xhochy]` you have made a lot of progress here, but a good amount of work still remains? I will move to 0.13 for now"
        },
        {
            "created_at": "2021-08-04T09:36:17.537Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2249?focusedCommentId=17392927) by Antoine Pitrou (apitrou):*\nIdeally, the C data interface would make this nearly seemless and avoid maintaining a specific Python-Java bridge, but it first must be implemented by the Java Arrow implementation: ARROW-12965"
        },
        {
            "created_at": "2022-07-12T14:04:16.517Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2249?focusedCommentId=17565498) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}