{
    "issue": {
        "title": "Continuing Education for Counselors - Benefits of Online CEUs",
        "body": "***Note**: This issue was originally created as [ARROW-13143](https://issues.apache.org/jira/browse/ARROW-13143). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nContinuing education for counselors (LPC, LPCC, LCP, and MHC) not only enriches the licensed counselor's practice but also satisfies individual state requirements for counselor CEUs for license renewals. These requirements are not only intended to keep the counselor up with the latest trends in the field but to update them on the latest risks and treatment options regardless of when they first began to practice or their field of expertise.\r\n\r\nThe focus of licensed counselors can vary greatly from one practice to another. For example: a licensed counselor in a school situation faces many different issues with at risk clients than that of a LPC whose practice focuses mainly upon the challenges of the aging population. Continuing education courses can reflect the different challenges faced by professionals in their areas of practice and the situations they and their clients face.\r\n\r\nWhether or not there are formal counselor CE requirements depends upon the state issuing the license; however, many individuals who work in a government or a state agency may have CE requirements set by their individual agency. For example: state agencies may require a specific number of CEUs for counselors practicing under their auspices. Even if there are no continuing education requirements in place, the challenges of a counselor's client population and the techniques for approaching these challenges are constantly changing. It takes more than just the occasional periodical to keep up with these changes. Online continuing education for counselors can assist the extremely busy professional counselor in keeping current with these changes and the needs of their target population while allowing them to leverage their available time in a more efficient fashion.\r\n\r\nThe minimum continuing education requirements in most states is from 20 to 40 hours depending upon the US state. Some states will also have additional requirements that set a specific number of hours in a course requirement such as ethics or risk assessment. Renewal of the license will usually involve providing proof of completion in the applicable areas. License cycles for counselors run from one to four years in length, again, depending on the state.\r\n\r\nSatisfying Continuing Education for Counselors Requirements for License Renewal\r\n\r\nDepending upon the individual state the continuing education requirements can vary. Many states will permit a combination of educational experiences to count toward the renewal of their counselor CEUs. A LPC working on a doctorate or whose has papers published may also apply this experience to credit against their license renewal requirements. Traditional classroom courses may also be applied toward the State's CE requirements.\r\n\r\nPerhaps one of the most innovative changes in continuing education for counselors is that of allowing credit for online courses. Many professional counselors are in private practice and the demands on their time are relentless. Most find that keeping up a personal life as well as a practice can be challenging and the requirements for CEUs may be simply one more thing on an already too full schedule. However, with online courses from a state board approved educational organization the burden of CE is notably less onerous, since courses and study takes place on their schedule. Selecting a continuing education class need not be a matter of taking what is available regardless of the content or its applicability to their practice.\r\n\r\nCheck our site for more information: <https://complextime.com/>\r\n\r\nMethods and challenges are constantly changing and the focus of the LPC must change with it. Additionally, changes in individual state laws require the licensed counselor be aware of their legal obligations as well as the ethics of sometimes entirely new situations. There are rarely grey areas in the laws that apply to the professional counselor and their responsibilities in reporting, and it is imperative they keep up with changes in the laws and current requirements. Continuing education for counselors in ethics and legalities is almost a professional necessity regardless of whether the state requires them for license renewal.\r\n\r\nIt is entirely possible to combine online counselor CEUs with offline seminars and other educational experiences to satisfy a state's requirements for renewal of the counselor's license. This can be particularly useful when the professional's state or employer's requirements include courses not available locally. In the real world very few professionals can take off on someone else's schedule to attend coursework in another city or across the state.\r\n\r\nChoosing Continuing Education for Counselors Courses\r\n\r\nCounselors choosing continuing education courses or CEUs to meet state requirements may have to choose specific course work according to their state requirements but in many cases, the professional will have the freedom to either explore new areas applicable to their current practice or investigate related areas. Rather than a chore required by a state; continuing education for counselors can permit them to expand their areas of expertise and bring new approaches into their practices.",
        "created_at": "2021-06-22T11:36:33.000Z",
        "updated_at": "2021-06-22T12:27:46.000Z",
        "labels": [
            "Migrated from Jira",
            "Type: bug"
        ],
        "closed": true,
        "closed_at": "2021-06-22T12:27:46.000Z"
    },
    "comments": []
}