{
    "issue": {
        "title": "[R] Expose Azure Blob Storage filesystem",
        "body": "***Note**: This issue was originally created as [ARROW-16791](https://issues.apache.org/jira/browse/ARROW-16791). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nI'd like to see the R arrow package be able to interface with the Azure Blob Storage file system from the AzureStor package.\r\n\r\n \r\n\r\nIn python, pyarrow and adlfs work together so I'd like for AzureStor and arrow under R to also work together.",
        "created_at": "2022-06-08T19:51:12.000Z",
        "updated_at": "2022-09-02T13:04:50.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: R",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-06-29T16:59:23.949Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16791?focusedCommentId=17560382) by Will Jones (willjones127):*\nPyArrow and adlfs work because we implement a compatibility layer between Python fsspec filesystems and PyArrow filesystems.\r\n\r\nIIUC you are suggesting we could implement some similar integration in R? Does there exist a standard protocol analogous to fsspec?"
        },
        {
            "created_at": "2022-07-13T03:27:34.109Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16791?focusedCommentId=17566128) by Dean MacGregor (deanm0000):*\nI don't think so but I don't really know enough about how pyarrow or r arrow works behind the scenes to answer your question.\r\n\r\n \r\n\r\nI just know azure blob works in pyarrow, that R arrow works with S3 (or at least the documentation is there) and I'm assuming that the difference between s3 and azure isn't too big. \r\n\r\n \r\n\r\n "
        },
        {
            "created_at": "2022-09-02T12:10:56.154Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16791?focusedCommentId=17599464) by Dean MacGregor (deanm0000):*\nI found that in arrow/r/src/filesystem.cpp, on lines 38-40 there's a comment block which says to uncomment them for AzureBlobFileSystem when R6 classes are made.  However, when looking further, it seems that there is more in the cpp file for s3 and GCS than just that reference but nothing else for Azure so I guess that comment should be more of a TODO since, unless I'm missing a lot (which is all too possible) there's much more needed for Azure to work than just an R6 class, no?\r\n\r\n \r\n\r\nTo that end, Microsoft has <https://github.com/Azure/azure-sdk-for-cpp> for using azure in cpp.\r\n\r\n \r\n\r\nI don't know cpp enough (really, at all) to be able to extend MS's code into something usable for arrow but just wanted to put the link in here in case it's helpful."
        },
        {
            "created_at": "2022-09-02T13:04:50.927Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16791?focusedCommentId=17599485) by Neal Richardson (npr):*\nThanks, yeah, that's being added to the C++ library in ARROW-2034. Once that is merged, we can add R bindings. "
        }
    ]
}