{
    "issue": {
        "title": "[C++][Python] Enable automate re-build of Arrow Python",
        "body": "***Note**: This issue was originally created as [ARROW-17017](https://issues.apache.org/jira/browse/ARROW-17017). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nEnable Arrow Python to rebuild \"automatically\" when C++ has changed, not needing to manually remove the python/build directory.\r\n\r\nSee: <https://github.com/apache/arrow/pull/13311#issuecomment-1178777287>\r\n\r\nThis can be done when <https://github.com/apache/arrow/pull/13311> is merged - if we see there is a need to do so.",
        "created_at": "2022-07-08T12:04:44.000Z",
        "updated_at": "2022-10-03T09:03:25.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Component: Python",
            "Type: task"
        ],
        "closed": true,
        "closed_at": "2022-10-03T09:03:25.000Z"
    },
    "comments": [
        {
            "created_at": "2022-10-03T09:03:03.401Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-17017?focusedCommentId=17612218) by Alenka Frim (alenka):*\nIt would be nice that PyArrow C++ code gets re-build when Arrow C++ changes to avoid compilation issues and manual removal of stale artefacts. But it is not very straightforward how this could be done plus as Arrow C++ and PyArrow are now two different projects, we do not see this being needed.\r\n\r\nFor this reason I am closing this issue as I do not think it is feasible.\r\n\r\nTo change focus a bit: it would be great to have automate helper tools to aid developers in such cases (changes in Arrow C++ or PyArrow C++ that would imply a need for a clean rebuild). Quoting `[~jorisvandenbossche]` :\r\n> helper tool (probably using an archery subcommand?) for convencience, so you can more easily perform tasks like \"a clean rebuild of pyarrow cpp\" without having to manually clear the build directory.Also other tasks like \"only build pyarrow cpp (not cython)\" could also be useful if you are iterating on pyarrow C++ code (at least as long as each build always fully rebuilds cython).\r\nI think this would be a good separate Jira issue."
        }
    ]
}