{
    "issue": {
        "title": "[Rust] Unable to read Parquet file because of mismatch in column-derived and embedded schemas",
        "body": "***Note**: This issue was originally created as [ARROW-11269](https://issues.apache.org/jira/browse/ARROW-11269). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe issue seems to stem from the new(-ish) behavior of the Arrow Parquet reader where the embedded arrow schema is used instead of deriving the schema from the Parquet columns.\r\n\r\n \r\n\r\nHowever it seems like some cases still derive the schema type from the column types, leading to the Arrow record batch reader erroring out that the column types must match the schema types.\r\n\r\n \r\n\r\nIn our case, the column type is an int96 datetime (ns) type, and the Arrow type in the embedded schema is DataType::Timestamp(TimeUnit::Nanoseconds, Some(\"UTC\")). However, the code that constructs the Arrays seems to re-derive this column type as DataType::Timestamp(TimeUnit::Nanoseconds, None) (because the Parquet schema has no timezone information). And so, Parquet files that we were able to read successfully with our branch of Arrow circa October are now unreadable.\r\n\r\n \r\n\r\nI've attached an example of a Parquet file that demonstrates the problem. This file was created in Python (as most of our Parquet files are).\r\n\r\n \r\n\r\nI've also attached a sample Rust program that will demonstrate the error.",
        "created_at": "2021-01-16T16:29:23.000Z",
        "updated_at": "2021-03-12T15:32:19.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Rust",
            "Type: bug"
        ],
        "closed": true,
        "closed_at": "2021-01-20T04:05:18.000Z"
    },
    "comments": [
        {
            "created_at": "2021-01-16T18:51:36.336Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-11269?focusedCommentId=17266647) by Neville Dipale (nevi_me):*\nHi `[~m18e]`, thanks for reporting this. I hope it's not too late to merge a fix into 3.0.0, but I'll have a look at this tonight and tomorrow morning."
        },
        {
            "created_at": "2021-01-20T04:05:18.486Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-11269?focusedCommentId=17268358) by Neville Dipale (nevi_me):*\nIssue resolved by pull request 9253\n<https://github.com/apache/arrow/pull/9253>"
        }
    ]
}