{
    "issue": {
        "title": "[R] Minimum working example round-tripping a data frame from R to plasma to pandas",
        "body": "***Note**: This issue was originally created as [ARROW-3205](https://issues.apache.org/jira/browse/ARROW-3205). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nI see tremendous opportunity for interoperability between Python and R (two popular languages for data scientists) using Arrow as an interchange format.\r\n\r\nTo make this concrete and get developers in those languages interested, I think it would be valuable to create a minimum working example of writing an R data frame into plasma and reading it back up into **pandas** in a separate Python process, and vice versa.\r\n\r\nI could, for example, envision reading a CSV up into a **data.table** in R to do some cleaning and feature engineering, writing that object to **plasma**, then kicking off multiple parallel Python processes to search a space of models. This could demonstrate the benefits of replacing \"load this dataset from a file 50 times\" with \"read off this range of memory in plasma\".\r\n\r\n \r\n\r\nI believe pretty strongly that a tangible example like this would meaningfully improve the R community's interest in and engagement with the Arrow project.",
        "created_at": "2018-09-10T04:12:07.000Z",
        "updated_at": "2020-09-25T23:16:52.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: R",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2020-09-25T23:16:52.000Z"
    },
    "comments": [
        {
            "created_at": "2020-09-25T23:16:52.303Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-3205?focusedCommentId=17202455) by Neal Richardson (npr):*\nPer mailing list discussions, Plasma is not being maintained anymore"
        }
    ]
}