{
    "issue": {
        "title": "[C#][FlightRPC] incompatible with java client for empty record batches",
        "body": "***Note**: This issue was originally created as [ARROW-10939](https://issues.apache.org/jira/browse/ARROW-10939). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nAn error has been found when one sends an empty record batch from C# server and tries to read it with the java client.\r\n\r\nFrom investigation the java client requires the protobuf tags to be sent in the message even though it is empty. Java code can be seen here:\r\n\r\n<https://github.com/apache/arrow/blob/master/java/flight/flight-core/src/main/java/org/apache/arrow/flight/ArrowMessage.java>\r\n\r\nLine 257-301 (the error is that it wont accept a null body for a record batch)\r\n\r\nNormal functionality of gRPC is to exclude the entire tag if an object is empty, example code from generated csharp:\r\n\r\nif (DataBody.Length != 0)\r\n\r\n{ output.WriteRawTag(194, 62); output.WriteBytes(DataBody); }\r\n\r\nTo fix this so the csharp version is compatible with the java client requires a non empty flight data body must be sent or at least the tag of the body.",
        "created_at": "2020-12-16T12:48:59.000Z",
        "updated_at": "2020-12-18T16:49:39.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C#",
            "Component: FlightRPC",
            "Type: bug"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2020-12-16T12:53:28.348Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10939?focusedCommentId=17250284) by Alexander (Östman):*\n`[~eerhardt]` since you reviewed the flight code, this is something I discovered. Wondered if you could give some input if you have time.\r\n\r\nIn my opinion this should probably be solved in the java client, but I were thinking of making a \"ugly\" fix for the csharp code so its atleast compatible with java client as it is right now and it can be removed later. This is because the java client has quite a lot more custom code and a change there will probably take some time.\r\n\r\nI will send in a PR atleast I think and we can see if its something that should be included or not."
        },
        {
            "created_at": "2020-12-18T16:49:39.067Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10939?focusedCommentId=17251867) by David Li (lidavidm):*\nThanks for catching this. The C++ implementation has a similar issue. I've filed ARROW-10962 to fix this on the Java side (and ARROW-10960 should fix this on the C++ side)."
        }
    ]
}