{
    "issue": {
        "title": "[C++][Python] UDF Integration ",
        "body": "***Note**: This issue was originally created as [ARROW-15635](https://issues.apache.org/jira/browse/ARROW-15635). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe objective is to list down a set of tasks required to provide UDF support for Apache Arrow streaming execution engine. In the first iteration we will be focusing on providing support for Python-based UDFs which can support Python functions. \r\n\r\nThe UDF Integration is going to pan out with a series of sub-tasks associated with the development and PoCs. Note that this is going to be the first iteration of UDF integrations with a limited scope. This ticket will cover the following topics;\r\n1. POC for UDF integration: The objective is to evaluate the existing components in the source and evaluate the required modifications and new building blocks required to integrate UDFs.\n1. The language will be limited to C+{}/{}Python users can register Python function as a UDF and use it with an `apply` method on Arrow Tables or provide a computation API endpoint via arrow::compute API. Note that the C+ API already provides a way to register custom functions via the function registry API. At the moment this is not exposed to Python. \n1. Planned features for this ticket are;\n   1. Scalar UDFs : UDFs executed per value (per row)\n   1. Vector UDFs : UDFs executed per batch (a full array or partial array)\n   1. Aggregate UDFs : UDFs associated with an aggregation operation\n1. Integration limitations\n   1. Doesn't support custom data types which doesn't support Numpy or Pandas\n   1. Complex processing with parallelism within UDFs are not supported\n   1. Parallel UDFs are not supported in the initial version of UDFs. Allthough we are documenting what is required and a rough sketch for the next phase. ",
        "created_at": "2022-02-10T00:56:27.000Z",
        "updated_at": "2022-10-25T07:08:09.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Component: Python",
            "Type: task"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-02-10T01:28:43.171Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15635?focusedCommentId=17489904) by Weston Pace (westonpace):*\nCan you add some scope to this?  Are you planning on tackling all types of UDFs (e.g. scalar, vector, aggregate, post-aggregate, etc.) in this one JIRA and those will be subtasks?  Or is this JIRA to aim for a specific type of UDF first?"
        },
        {
            "created_at": "2022-02-10T06:00:16.831Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15635?focusedCommentId=17489975) by Vibhatha Lakmal Abeykoon (vibhatha):*\nThanks `[~westonpace]`   for the note. In this ticket(jira) we should include all and I have missed to document the scope accurately. I will add them as sub tasks. "
        },
        {
            "created_at": "2022-02-10T14:09:47.699Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15635?focusedCommentId=17490281) by Vibhatha Lakmal Abeykoon (vibhatha):*\n`[~westonpace]`  I added more content on the scope of the first iteration for UDFs. \r\nI clearly don't expect to include all the features for UDFs. But we should support all the useful cases for quries we are planning to execute. Any missing pieces? "
        },
        {
            "created_at": "2022-02-10T18:41:35.977Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15635?focusedCommentId=17490429) by Weston Pace (westonpace):*\nThanks, this is helpful.  This might be interesting to `[~jorisvandenbossche]` `[~amol-]` as well."
        },
        {
            "created_at": "2022-08-26T16:05:52.408Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15635?focusedCommentId=17585501) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned per [project policy](https://arrow.apache.org/docs/dev/developers/bug_reports.html#issue-assignment). Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}