{
    "issue": {
        "title": "[R] Improvements to Linux installation troubleshooting",
        "body": "***Note**: This issue was originally created as [ARROW-10733](https://issues.apache.org/jira/browse/ARROW-10733). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\n- Some people think that they need to install the arrow package and then call install_arrow... which just installs the package again. A number of packages with external dependencies (python, etc.) have this pattern, so it's understandable why people are confused.\n- If installation fails, you get the arrow-without-arrow package, which tells you to run install_arrow. This was reasonable advice when we first got on CRAN and the CRAN version did not build the C++ library but install_arrow would. But now that installation from CRAN will try to build the C++ library, if installation failed the first time, it will probably fail the second time too. Some possible improvements: (1) don't recommend install_arrow in that error message; (2) set ARROW_R_DEV=true in install_arrow for verbosity, detect if installation failed, and direct the user to report the full logs if it did; (3) if the user is on centos-7, print a special message pointing to the installation troubleshooting.\n- The linux installation vignette's troubleshooting section should prominently recommend retrying with ARROW_R_DEV=true and reporting the logs in your bug report. It's usually the first thing I ask in response to a bug report.",
        "created_at": "2020-11-25T18:30:02.000Z",
        "updated_at": "2020-12-30T17:15:47.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: R",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2020-12-30T17:15:42.000Z"
    },
    "comments": [
        {
            "created_at": "2020-12-30T17:15:42.319Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10733?focusedCommentId=17256622) by Neal Richardson (npr):*\nIssue resolved by pull request 9034\n<https://github.com/apache/arrow/pull/9034>"
        }
    ]
}