{
    "issue": {
        "title": "[C++] Evolution of exec plan",
        "body": "***Note**: This issue was originally created as [ARROW-16522](https://issues.apache.org/jira/browse/ARROW-16522). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThis is a high level JIRA that will be broken into a number of subtasks. There are a number of things that each node has to reinvent (or, more likely, copy/paste) and it we probably know enough at this point that we can enhance the ExecNode/ExecPlan API a bit to move some of the burden out of the nodes and into the plan. At a high level:\r\n \\* All nodes that schedule tasks use an async task group so they can make sure that all scheduled tasks are finished before the node is marked finish. Task scheduling could happen at the plan level and there would be one spot keeping track of running tasks.\r\n \\* If we have centralized scheduling then that opens up the door for a centralized handling of errors and backpressure. A node's default error behavior is then \"stop scheduling tasks\" and a node's default backpressure behavior is \"stop running tasks\".\r\n \\* There are no nodes that emit to multiple outputs today. Sending data to multiple outputs is not simple. This is a pipeline breaking activity and new tasks will need to be scheduled and the data will need to be held onto until each downstream task has run, and backpressure may need to be applied if one output is slower than the other. Node's should not be given the choice of multiple outputs unless they are solving specifically that problem (e.g. temporary table).\r\n\r\nA small document describing the proposed changes is here: https://docs.google.com/document/d/1yFFUXRsN9Un89Xua-mwJnLRM60gjOBgeWdqtxL9tDSI/edit?usp=sharing",
        "created_at": "2022-05-11T02:04:37.000Z",
        "updated_at": "2022-08-26T17:26:14.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-08-26T16:05:51.480Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16522?focusedCommentId=17585482) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned per [project policy](https://arrow.apache.org/docs/dev/developers/bug_reports.html#issue-assignment). Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}