{
    "issue": {
        "title": "[C++] Add a C++ query testing tool",
        "body": "***Note**: This issue was originally created as [ARROW-15877](https://issues.apache.org/jira/browse/ARROW-15877). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nWe have a number of tools for running queries today that we can use when benchmarking and profiling.\r\n\r\n- We can create tests in google test but then it is often difficult to pass in extra arguments like switching between queries and dynamically changing the number of iterations.\n- We can simply create a quick executable but there is some project creation overhead and queries end up being hard-coded to something rather specific.\n- We can use arrowbench but that adds an R dependency which is a burden for C++ testers that don't work with R much and it also adds some R overhead or complications for debugging.\n  \n  This JIRA proposes we create a new query testing tool, inspired by arrowbench, but written in C++, which will initially allow us to run builtin TPC-H queries against the TPC-H data generator but will eventually allow for downloading datasets from remote sources, running custom queries via SQL or Substrait, etc.",
        "created_at": "2022-03-09T01:47:04.000Z",
        "updated_at": "2022-07-22T01:38:48.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-07-12T14:04:29.667Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15877?focusedCommentId=17565654) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}