{
    "issue": {
        "title": "[C++][Dataset] Remove Selector, ignore_prefixes from FileSystemDatasetFactory",
        "body": "***Note**: This issue was originally created as [ARROW-9748](https://issues.apache.org/jira/browse/ARROW-9748). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nCurrently FileSystemDatasetFactory can be constructed with an explicit listing of files or with a `fs::FileSelector`. Since the selector does not support sophisticated selection criteria, `FileSystemFactoryOptions::selector_ignore_prefixes` to allow users to exclude undesired files such as `_metadata` or `.DS_STORE`.\r\n\r\nThe selector + ignored prefixes mechanism is inflexible with numerous edge cases ( ARROW-9644 ARROW-9573 ). Furthermore, implementing more advanced file selection logic in dataset discovery prevents it from being reused by other consumers of the file system api.\r\n\r\nRemove FileSystemDatasetFactory's constructor-from-selector, optionally adding that functionality directly to `fs::FileSelector`. An explicit listing of files for use in construction of a FileSystemDatasetFactory can then be assembled using an `fs::FileSelector` and/or other globbing libraries, with arbitrary inclusion logic.",
        "created_at": "2020-08-14T20:16:42.000Z",
        "updated_at": "2022-07-12T14:04:48.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2020-08-14T20:17:15.693Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-9748?focusedCommentId=17178045) by Ben Kietzman (bkietz):*\n`[~jorisvandenbossche]` `[~npr]`"
        },
        {
            "created_at": "2020-08-18T09:13:18.830Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-9748?focusedCommentId=17179484) by Joris Van den Bossche (jorisvandenbossche):*\nI am not sure we should necessarily remove the \"constructor-from-selector\" at all? In any case, that doesn't necessarily seem needed to also do when removing the \"ignore_prefixes\" functionality (because passing just a selector without any \"ignore_prefixes\" logic doesn't give any ambiguity or edge cases, I think?)\r\n\r\n_If_ we remove the custom \"ignore_prefixes\" behaviour from the FileSystemDatasetFactory discovery functionality, the question is how to replace it:\r\n\r\n- Do we add similar functionality to `FileSelector` ? So we still provide basic \"ignore_prefix\" functionality in C++ (for our python/R bindings to use), but move it from the dataset discovery implementation to the filesystem (FileSelector) implementation (which is maybe a more logical place to put this)\n- Or do we fully delegate this responsibility of providing \"ignore_prefix\" (or more advanced file filtering) functionality to the bindings? So both Python and R need to implement this in their \"(open_)dataset(..)\" wrapper, both using tools available in their language.\n  \n  Another feature we might want to provide which is related to this is basic \"globbing\" / wildcard syntax, like `\"/my/dataset/*.parquet\"`, which can also give a way to filter out unwanted files (and the same question applies here: do we want to add this feature to the FileSelector, or is this a responsibility of the bindings?)\n"
        },
        {
            "created_at": "2022-07-12T14:04:48.588Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-9748?focusedCommentId=17565761) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}