{
    "issue": {
        "title": "[C++] Reconsider filesystem equality",
        "body": "***Note**: This issue was originally created as [ARROW-16928](https://issues.apache.org/jira/browse/ARROW-16928). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nFilesystems support an equality method to compare filesystem instances. The original idea is that all filesystem parameters should be transparent and easily read back, so it should be possible to support equality (similarly, it was envisioned to allow roundtripping filesystems through URIs, though the filesystem-to-URI direction was never implemented).\r\n\r\nHowever, along the way, filesystems like S3 grew increasingly complex and opaque modes of configuration where equality can only be approximated. It can also be costly to compute (for example, `S3Options::Equals` involves fetching the actual secret key and session token, which can take some time: these mere operations consume 5 seconds in the PyArrow test suite).\r\n\r\nRight now, filesystem equality is merely used for testing on the Python side (to try and validate filesystem pickling).\r\n\r\nWe should decide whether we want to continue supporting filesystem equality and, if so, what the semantics are (is approximate equality useful?).",
        "created_at": "2022-06-28T17:30:07.000Z",
        "updated_at": "2022-06-28T17:59:50.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: task"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-06-28T17:30:28.130Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16928?focusedCommentId=17559880) by Antoine Pitrou (apitrou):*\ncc `[~lidavidm]` `[~jorisvandenbossche]` `[~westonpace]` for opinions"
        },
        {
            "created_at": "2022-06-28T17:59:50.707Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16928?focusedCommentId=17559895) by David Li (lidavidm):*\nSetting `AWS_EC2_METADATA_DISABLED=true` should sidestep the 5 second issue locally, but that is painful in general.\r\n\r\nI can't think of great uses for equality off the top of my head. And even if it did come in handy, I think those use cases would only need approximate equality (\"do these two point to the same storage subsystem/prefix\") which is itself already fuzzy (in the presence of soft/hard links)."
        }
    ]
}