{
    "issue": {
        "title": "[C++] Decide how we want to handle time zone strings in Substrait",
        "body": "***Note**: This issue was originally created as [ARROW-15537](https://issues.apache.org/jira/browse/ARROW-15537). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nSubstrait timestamp_with_tz type does not include the timezone string as a type parameter.  This may not be an issue.  Substrait functions that care about the timezone of a column (e.g. strftime) will include the time zone string as an argument.  So for purely consumption purposes we shouldn't have any Substrait function / operation that depends on this timezone metadata.\r\n\r\nHowever, it may be an issue for export.  I'm creating this JIRA as a placeholder for someone to think the problem through more fully and decide if we need to do anything.",
        "created_at": "2022-02-02T21:47:38.000Z",
        "updated_at": "2022-07-07T10:10:12.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-07-07T10:10:12.395Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15537?focusedCommentId=17563665) by Jeroen van Straten (jvanstraten):*\nI think the most reasonable thing to do here would be to make an extension type that includes a timezone string parameter, as made possible by <https://github.com/substrait-io/substrait/pull/196>. I advocated for parameterized type variations there as well for this reason, so we could just expose something like a with_timezone<str> variation on timestamp_tz to get e.g. timestamp[with_timezone<\"UTC+1\">]. IMO that would have made compatibility between consumers way easier, since all functions that can use the base variation of timestamp_tz would automatically support Arrow's variations that way. However, that change was rejected."
        }
    ]
}