{
    "issue": {
        "title": "[JAVA] clear should release the buffer only if the buffer is not NULL",
        "body": "***Note**: This issue was originally created as [ARROW-1478](https://issues.apache.org/jira/browse/ARROW-1478). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nIn some cases we use a fake allocator in Dremio for the purpose of field materialization only. The buffers of the underlying vectors are not allocated. Fake allocator is a simple implementation of BufferAllocator interface where almost every method throws UnsupportedOperation exception and methods like getEmpty() return NULL.\n\nIt is more like a pass-through mechanism that allows us to be able to instantiate a vector using a non-functional allocator since the constructors in vector code don't allow for the allocator itself to be NULL.\n\nPortions of code where we have this scenario are generic in nature and so have typical methods like close() / clear() which underneath invoke the corresponding methods on vectors.\n\nThe clear() method in BaseDataValueVector releases the data buffer without checking if the buffer is NULL and that's where callers hit NPE.\n\nWe don't see such problems in Arrow unit tests. My guess is that when a vector is instantiated, the buffer is still probably a valid reference returned through allocator.getEmpty() call in the constructor of BaseDataValueVector.\n\n\n",
        "created_at": "2017-09-06T17:58:03.000Z",
        "updated_at": "2017-10-19T00:47:55.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Java",
            "Type: bug"
        ],
        "closed": true,
        "closed_at": "2017-09-20T16:42:36.000Z"
    },
    "comments": [
        {
            "created_at": "2017-09-20T16:42:36.811Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-1478?focusedCommentId=16173475) by Siddharth Teotia (siddteotia):*\nNot needed."
        }
    ]
}