{
    "issue": {
        "title": "[C++][Dataset] Add FlightFragment",
        "body": "***Note**: This issue was originally created as [ARROW-10524](https://issues.apache.org/jira/browse/ARROW-10524). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nAllow wrapping a flight service as a dataset/fragment",
        "created_at": "2020-11-09T17:39:27.000Z",
        "updated_at": "2022-07-12T14:04:47.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2021-01-05T18:38:41.500Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10524?focusedCommentId=17259126) by Antoine Pitrou (apitrou):*\ncc `[~lidavidm]`"
        },
        {
            "created_at": "2021-01-05T19:44:25.206Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10524?focusedCommentId=17259170) by David Li (lidavidm):*\nHappy to serve as review or answer questions if needed."
        },
        {
            "created_at": "2021-09-29T18:51:15.095Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10524?focusedCommentId=17422342) by David Li (lidavidm):*\nRelevant discussion from the Skyhook PR: <https://github.com/apache/arrow/pull/10431#discussion_r683685887>\r\n\r\nIn summary, for backends like this where we may be able to push down some computation, we need to consider how best to integrate that into the rest of the pipeline. The latest PR in ARROW-13607 introduces a flag on Fragment that toggles whether the scanner applies filtering/projection or not, which should fit with the presumed approach here. (The story is more complicated for Skyhook because they are halfway between a file and a fragment; for data from Flight it is fairly clear that it should be a Fragment.)"
        },
        {
            "created_at": "2021-09-29T23:46:14.465Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10524?focusedCommentId=17422448) by Weston Pace (westonpace):*\nI don't really like the flag on the fragment (see https://github.com/apache/arrow/pull/10913#discussion_r699822754).  Pushing down some computation is ok and we have mechanisms for it.  For example, pushing down a filter is fine and the mechanism is the guarantee.\r\n\r\nPushing down projection is not generally a good idea.  For example, consider a query with an order by where the order key column is removed by the projection.  On the other hand, fragments do need to be able to project/cast from the file schema to the dataset schema but this is a different problem statement.\r\n\r\nFor more general computation we are venturing into the realm of a distributed query engine and not a fragment or file format.  As another example, consider an order by.  You can push down the sorting but you have to do a corresponding merge.  That might make sense if all your leaves can handle sort but if only some of your leaves can handle sort then I don't know if there is much merit in getting back some batches sorted and others unsorted."
        },
        {
            "created_at": "2021-09-30T00:10:17.237Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10524?focusedCommentId=17422452) by David Li (lidavidm):*\nFair point, thanks for chiming in. (I linked the PR mostly so that we don't forget when we get to this point for Flight.) I suppose the main question is that defining a single \"Flight\" fragment still doesn't quite make sense (is it defined by a Ticket? a FlightDescriptor expected to be paired with GetFlightInfo? Something else?)\r\n\r\nFor the example given, I suppose if your engine is doing a distributed merge sort, then knowing one input to the sort is already sorted might still reduce your workload."
        },
        {
            "created_at": "2021-09-30T20:15:25.771Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10524?focusedCommentId=17422999) by Weston Pace (westonpace):*\nI created ARROW-14186 for more general discussion of the topic."
        },
        {
            "created_at": "2022-07-12T14:04:47.312Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10524?focusedCommentId=17565747) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned. Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}