{
    "issue": {
        "title": "[Python] Create tools to enable optional components (like Gandiva, Flight) to be built and deployed as separate Python packages",
        "body": "***Note**: This issue was originally created as [ARROW-8518](https://issues.apache.org/jira/browse/ARROW-8518). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nOur current monolithic approach to Python packaging isn't likely to be sustainable long-term.\r\n\r\nAt a high level, I would propose a structure like this:\r\n\r\n```Java\n\r\npip install pyarrow  # core package containing libarrow, libarrow_python, and any other common bundled C++ library dependencies\r\n\r\npip install pyarrow-flight  # installs pyarrow, pyarrow_flight\r\n\r\npip install pyarrow-gandiva # installs pyarrow, pyarrow_gandiva\r\n```\r\n\r\nWe can maintain the semantic appearance of a single `pyarrow` package by having thin API modules that would look like\r\n\r\n```Java\n\r\nCONTENTS OF pyarrow/flight.py\r\n\r\nfrom pyarrow_flight import *\r\n```\r\n\r\nObviously, this is more difficult to build and package:\r\n\r\n- CMake and setup.py files must be refactored a bit so that we can reuse code between the parent and child packages\n- Separate conda and wheel packages must be produced. With conda this seems more straightforward but since the child wheels depend on the parent core wheel, the build process seems more complicated\n  \n  In any case, I don't think these challenges are insurmountable. This will have several benefits:\n  \n- Smaller installation footprint for simple use cases (though note we are STILL duplicating shared libraries in the wheels, which is quite bad)\n- Less developer anxiety about expanding the scope of what Python code is shipped from apache/arrow. If in 5 years we are shipping 5 different Python wheels with each Apache Arrow release, that sounds completely fine to me. ",
        "created_at": "2020-04-19T21:14:16.000Z",
        "updated_at": "2022-05-04T14:28:16.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Packaging",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": []
}