{
    "issue": {
        "title": "[Java][Docs] Fix IntelliJ IDE setup instructions",
        "body": "***Note**: This issue was originally created as [ARROW-15959](https://issues.apache.org/jira/browse/ARROW-15959). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nA few more things need to be documented to get debugging working in IntelliJ, at least in my experience. This is probably because instead of using the Maven build, I'm using IntelliJ's native build, which lets me one-click run a particular class or test, but needs some extra configuration.\r\n \\* Must unset \"Use --release option for cross compilation\" in compiler settings\r\n \\* Must build once with Maven and mark the arrow-vector/target/generated-sources directory as a generated sources root",
        "created_at": "2022-03-17T12:37:21.000Z",
        "updated_at": "2022-05-07T08:51:16.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Documentation",
            "Component: Java",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2022-05-03T18:41:55.000Z"
    },
    "comments": [
        {
            "created_at": "2022-04-26T19:17:42.125Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15959?focusedCommentId=17528365) by David Li (lidavidm):*\nTracing my steps: I started with a fresh IntelliJ 2022.1 installation. I installed IdeaVim and CheckStyle-IDEA for reference.\r\n\r\nI then opened the `java` subdirectory of a fresh Arrow checkout, and waited for the Maven sync. That ran into \r\n\r\n```\n\r\nCould not find artifact io.netty:netty-transport-native-unix-common:jar:${os.detected.name}-${os.detected.arch}:4.1.72.Final in central (https://repo.maven.apache.org/maven2)\r\n```\r\n\r\nThis seems to be related to https://github.com/trustin/os-maven-plugin/issues/19. I updated the plugin and re-opened the IDE, which seemed to fix it mostly, except in flight-integration-tests which had\r\n\r\n```\n\r\nUnresolved dependency: 'io.netty:netty-transport-native-unix-common:jar:4.1.72.Final'\r\n```\r\n\r\nAdding the os-maven-plugin didn't help here. Deactivating the linux-netty-native profile in the Maven pane did. I think this might be because IntelliJ isn't substituting the os properties when dependencies come from a profile. \r\n\r\nNow Maven syncs. I tried to build the project and had to set an SDK. I chose JDK11 and set the language level to 8, then tried building again. That led to \r\n\r\n```\n\r\npackage sun.misc does not exist\r\n```\r\n\r\nThat seems to be related to https://youtrack.jetbrains.com/issue/IDEA-201168. I disabled the option specified there and the build continued. Now the build fails in TestExpandableByteBuf. Honestly, I think this file is in the wrong package…I moved it into arrow-memory-netty.\r\n\r\nContinuing on, the build fails because it can't find the auto-generated sources. So then I manually invoked `mvn compile`. That inexplicably failed from within IntelliJ, so I switched to the CLI and ran `mvn compile` manually, which seemed to work fine. That generated `arrow-vector/target/generated-sources`, so I found that in the IntelliJ Project pane and right-click > \"Mark Directory As\" > \"Generated Sources Root\". Then I restarted the build. This finally completed successfully!\r\n\r\nSo there's a couple things to do here:\r\n\r\n1. Document the Maven issue\n1. Submit an upgrade of os-maven-plugin\n1. Document the compiler issue\n1. Submit moving the test file (will have to check if we're currently accidentally not running those tests…)\n1. Document that you have to Maven compile first (will retry and see if tweaking pom.xml lets us avoid at least manually marking the sources root)\n   \n   Ah, the manual Maven build fails because of this: https://youtrack.jetbrains.com/issue/IDEA-278903\n   \n   Disabling fork indeed fixes it in IntelliJ. Not sure how to set the other options mentioned."
        },
        {
            "created_at": "2022-05-03T18:41:55.264Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15959?focusedCommentId=17531357) by David Li (lidavidm):*\nIssue resolved by pull request 13017\n<https://github.com/apache/arrow/pull/13017>"
        }
    ]
}