{
    "issue": {
        "title": "[R] [CI] Clean up our snappy-sanitizer skipping behavior",
        "body": "***Note**: This issue was originally created as [ARROW-16385](https://issues.apache.org/jira/browse/ARROW-16385). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nWe have a number of locations where we skip parquet tests now that snappy is built by default + we use it by default when it is built.\r\n\r\nOne recent example of needing to do this is https://github.com/apache/arrow/pull/13014\r\n\r\nHowever, skipping tests like this is a little bit of misdirection, since we aren't really skipping these because | when snappy is not available like the helper suggests, just using that helper to _also_ skip when we know we are in a sanitizer environment.\r\n\r\nThe ultimate answer to this, of course is to upstream the change https://github.com/google/snappy/pull/148 though that's been sitting open for a few months still.\r\n\r\nIn the meantime, what if we took out these skips and instead used uncompressed parquet for reading and writting in some builds? This way we could make sure that snappy was not running during sanitizer tests, but still have test coverage for these code paths in other runs where we don't need to worry about this sanitizer error in snappy.\r\n\r\nhttps://github.com/apache/arrow/pull/13014#discussion_r859970907 proposed one way to do this in this one case, but we should do it more generally for the other skips that we have had to add.",
        "created_at": "2022-04-27T19:28:05.000Z",
        "updated_at": "2022-09-05T12:20:15.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Continuous Integration",
            "Component: R",
            "Type: bug"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-04-28T15:58:32.075Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16385?focusedCommentId=17529507) by Jacob Wujciak-Jens (assignUser):*\nGiven that snappy has a very slow release cadence and the patch has been untouched for month now, would it maybe make sense to rely on a fork with the patch merged (e.g. Antoine's)?\r\n\r\nOpinions `[~apitrou]` `[~kou]` ?"
        },
        {
            "created_at": "2022-04-28T16:21:30.350Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16385?focusedCommentId=17529516) by Antoine Pitrou (apitrou):*\nMy opinion is that we would generally like to avoid installing dependencies from forks, for auditability and trustability reasons, and also ongoing maintenance concerns."
        },
        {
            "created_at": "2022-04-28T21:51:59.126Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16385?focusedCommentId=17529669) by Kouhei Sutou (kou):*\nI agree with `[~apitrou]`.\r\n\r\nFor this case, can we detect Snappy version and whether sanitizer is enabled or not? We'll be able to write more descriptive skip logic for this with these information. (We skip the test only with Snappy 1.1.8 && sanitizer is enabled.)"
        },
        {
            "created_at": "2022-09-05T12:20:15.183Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16385?focusedCommentId=17600368) by Jacob Wujciak-Jens (assignUser):*\nThe patch was finally merged sadly a release just happened, so we will have to keep this behavior for a while longer."
        }
    ]
}