{
    "issue": {
        "title": "[Rust] Enable \"#![warn(missing_docs)]\"",
        "body": "***Note**: This issue was originally created as [ARROW-4683](https://issues.apache.org/jira/browse/ARROW-4683). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nWe are moving fast with the Rust implementation and the docs can be ignored at times.  We are starting to get to the point where the project is useful and we should ensure that the docs are up to scratch to avoid hurting adoption.",
        "created_at": "2019-02-26T13:23:53.000Z",
        "updated_at": "2021-04-26T11:23:14.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Rust",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2021-04-26T11:23:14.000Z"
    },
    "comments": [
        {
            "created_at": "2019-03-10T01:53:37.792Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4683?focusedCommentId=16788828) by Owen Nelson (theomn):*\nAdding the attribute to arrow, datafusion, and parquet yields around 183 errors currently. I may take a little effort to cover the gap that exists right now.\r\n\r\n As a newcomer to the project, I'm looking for ways to explore the codebase and I'd welcome the chance to take a stab at this, however being so unfamiliar with the internals I may need to refer to the docs on one of the other lang's implementations. I may need to refer to the other implementations anyway just to keep the phrasing consistent. It could take some time.\r\n\r\nAny objections to me digging into this?\r\n\r\nAdditionally, would we prefer to set missing docs to warnings rather than errors now that CI will treat warnings as errors as of ARROW-2409?"
        },
        {
            "created_at": "2019-03-11T02:08:31.146Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4683?focusedCommentId=16789094) by Paddy Horan (paddyhoran):*\nHey,\r\n\r\nFeel free to dig into this.  I opened the issue as eventually I would like us to have this enabled.  But my plan was always to come back and open smaller documentation related issues that would build up to adding this feature.\r\n\r\nOne of the first PR's I did was to update the docs of the `datatypes` module so feel free to take it module by module as you learn the code base.\r\n\r\n+1 for warnings instead of errors now that you tackled ARROW-2409.\r\n\r\nFeel free to reach out if you have questions."
        },
        {
            "created_at": "2021-04-26T11:23:12.724Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-4683?focusedCommentId=17332021) by Andrew Lamb (alamb):*\nMigrated to github: https://github.com/apache/arrow-rs/issues/37"
        }
    ]
}