{
    "issue": {
        "title": "[C++/Python] Add option to Take kernel to interpret negative indices as indexing from the right",
        "body": "***Note**: This issue was originally created as [ARROW-9432](https://issues.apache.org/jira/browse/ARROW-9432). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nCurrently negative integers are explicitly forbidding in the `Take` kernel. It would be nice to have the option to treat negative integers as \"indices from the right\" instead.",
        "created_at": "2020-07-13T12:16:05.000Z",
        "updated_at": "2022-04-08T13:13:30.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Component: Python",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2020-07-13T15:52:01.292Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-9432?focusedCommentId=17156805) by Neal Richardson (npr):*\nIn R, negative indices means to take everything except those indices. So maybe these behaviors should be handled in Python/R, translating the requested indices to the \"normal\" form that the C++ library expects?"
        },
        {
            "created_at": "2020-07-13T20:19:48.692Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-9432?focusedCommentId=17156955) by Wes McKinney (wesm):*\nWe should not alter the existing Take implementation hot path. I agree with Neal that it would be better (when \"wraparound\" is required) to do a vectorized check for negative indices, and if any are encountered, to transform to all non-negative indices and then invoke the usual Take code path"
        },
        {
            "created_at": "2020-07-16T08:52:07.669Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-9432?focusedCommentId=17159023) by Uwe Korn (uwe):*\n> In R, negative indices means to take everything except those indices. So maybe these behaviors should be handled in Python/R, translating the requested indices to the \"normal\" form that the C++ library expects?\r\n\r\nUh, how would that work? I thought we have a 1:1 mapping of index in the array to a resulting row.\r\n\r\n> We should not alter the existing Take implementation hot path.\r\n\r\nI would rather have a second kernel implementation that is called if one requests the treatment of negative integers in this way. As one can see, I have opened two of these \"behave-different-on-negative-indices\" issues and R seems to have a third implementation. This shows that these kernels are useful but that there is no consensus on what they should do.\r\n"
        },
        {
            "created_at": "2021-02-17T16:38:24.919Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-9432?focusedCommentId=17285960) by Antoine Pitrou (apitrou):*\nWhile dedicated kernel variants would be faster, they would also increase the code size and build times substantially. This would have to be checked when drafting the implementation."
        },
        {
            "created_at": "2021-06-22T00:13:25.081Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-9432?focusedCommentId=17366910) by Wes McKinney (wesm):*\nIt might be acceptable to have a slower, but smaller (in code size) implementation. For example, simply transposing the negative indices to be positive and then invoking the non-negative-Take implementation"
        },
        {
            "created_at": "2021-09-01T01:58:43.933Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-9432?focusedCommentId=17407753) by Eduardo Ponce (edponce):*\nI think the core issue here is to support in a consistent manner, non-negative indices across compute kernels.\r\n\r\nGiven that there are multiple kernels that \"behave-different-on-negative-indices\" and there are different semantics of what a negative index entails, this can be handled in Arrow C++ by having a utility function with an option to dictate on how to interpret negative indices and always resolve to a set of nonnegative indices. For kernels that have index parameters and where negative indices are meaningful, we could have an option to specify the desired behavior and set the default value based on the language's semantics. These kernels would then resolve the negative indices before processing any data.\r\n\r\nThe drawback from this approach is having an additional (non-familiar) option for these kernels, so maybe resolving the negative indices in the particular language bindings might be a better choice."
        }
    ]
}