{
    "issue": {
        "title": "[C++] Support for textual, JSON schema representation",
        "body": "***Note**: This issue was originally created as [ARROW-8952](https://issues.apache.org/jira/browse/ARROW-8952). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nCurrently, Arrow has no textual representation for its schema that could serve the same purposes as JSON-Schema for JSON, the .proto files for Protobuf, etc. This issue is about adding such a text representation for an Arrow schema, to fill the same use cases that these textual representations fill for other data serialization formats.\r\n\r\nThe requirements for a text schema representation:\r\n \\* Data, not code (can be used without being run directly, unlike e.g. calls to the Python API to create a Schema object)\r\n \\* Readable by people who are experts in their field (e.g. data scientists, etc.) and are however _not_ Arrow experts, without needing the doc side by side\r\n \\* Small modifications possible with no or light usage of the doc (e.g. changing a field from int32 to int64)\r\n \\* Writing new schemas from scratch possible with the doc for non-Arrow experts\r\n \\* Not tied to a particular version of Arrow & compatible between Arrow versions\r\n\r\nAnd from a software engineering point of view, it would be very desirable for the implementation to not add another library dependency for Arrow (which already has many).\r\n\r\nAfter discussion on the mailing list, the JSON representation for Flatbuffers data seemed the best candidate. It is a format supported by the Flatbuffers projects for serializing Flatbuffers assets in a human-readable format, for inclusion under source-control. And there is already functionality in Arrow to convert Schema objects to a Flatbuffers representation. This would meet all the requirements above, while requiring only a small amount of new Arrow code to implement.\r\n\r\nThis issue will add functions Arrow to load and save a textual, JSON representation of an Arrow schema, by first converting it to a FlatBuffers object, and then using the Flatbuffers functionality to save/load such objects as JSON.",
        "created_at": "2020-05-26T18:04:39.000Z",
        "updated_at": "2022-10-12T12:02:17.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-08-26T16:05:53.259Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-8952?focusedCommentId=17585518) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned per [project policy](https://arrow.apache.org/docs/dev/developers/bug_reports.html#issue-assignment). Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}