{
    "issue": {
        "title": "[C data interface] Clarify that buffers must only be accessed past the offset",
        "body": "***Note**: This issue was originally created as [ARROW-14453](https://issues.apache.org/jira/browse/ARROW-14453). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nI would like to propose that we clarify in the c data interface that the buffers can only be accessed past the offset (with the pointer arithmetic corresponding to the buffer).\r\n\r\nE.g. given a primitive array with an offset of 10 and buffer starting at pointer position `p`, consumers _must not_ access any of the positions [p, p+1, ..., p-1+9].\r\n\r\nWithout the condition above, it is not possible for a user to use a sliced buffer on a primitive array with a validity and an offset.\r\n\r\nE.g. consider an array with an offset of 10, a buffer of 12 u8s that has been sliced by 4. For the array to be exported correctly, we will need to offset the buffer by -6 (4 - 10), so that the consumer can jump the first 10 bytes and only \"see\" the bytes at positions 4, 5, 6, etc of the original pointer.\r\n\r\nNote that this behavior (of slicing a buffer and building an array with it) can only be done with buffers. In the booleanArray it is currently not possible to \"slice\" the buffer without it being a multiple of 8 slots, since the C data interface has no mechanism to share independent offsets.\r\n",
        "created_at": "2021-10-23T18:06:58.000Z",
        "updated_at": "2021-11-03T18:13:52.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Format",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2021-11-03T18:10:25.854Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-14453?focusedCommentId=17438225) by Antoine Pitrou (apitrou):*\nThis sounds like a reasonable requirement. Do you want to submit a PR and we can discuss the wording there?"
        },
        {
            "created_at": "2021-11-03T18:13:52.360Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-14453?focusedCommentId=17438229) by Jorge Leitão (jorgecarleitao):*\nThanks for reviewing the idea. will do!"
        }
    ]
}