{
    "issue": {
        "title": "[C++] Implement ability to retrieve fragment filename",
        "body": "***Note**: This issue was originally created as [ARROW-15281](https://issues.apache.org/jira/browse/ARROW-15281). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nA user has requested the ability to include the filename of the CSV in the dataset output - see discussion on ARROW-15260 for more context.\r\n\r\nRelevant info from that ticket:\r\n\r\n \r\n\"From a C++ perspective we've got many of the pieces needed already. One challenge is that the datasets API is written to work with \"fragments\" and not \"files\". For example, a dataset might be an in-memory table in which case we are working with InMemoryFragment and not FileFragment so there is no concept of \"filename\".\r\n\r\nThat being said, the low level ScanBatchesAsync method actually returns a generator of TaggedRecordBatch for this very purpose. A TaggedRecordBatch is a struct with the record batch as well as the source fragment for that record batch.\r\n\r\nSo if you were to execute scan, you could inspect the fragment and, if it is a FileFragment, you could extract the filename.\r\n\r\nAnother challenge is that R is moving towards more and more access through an exec plan and not directly using a scanner. In order for that to work we would need to augment the scan results with the filename in C++ before sending into the exec plan. Luckily, we already do this a bit as well. We currently augment the scan results with fragment index, batch index, and whether the batch is the last batch in the fragment.\r\n\r\nSince ExecBatch can work with constants efficiently I don't think there will be much performance cost in always including the filename. So the work remaining is simply to add a new augmented field _{_}fragment_source_name which is always attached if the underlying fragment is a filename. Then users can get this field if they want by including \"{_}_fragment_source_name\" in the list of columns they query for.\"",
        "created_at": "2022-01-07T12:17:12.000Z",
        "updated_at": "2022-04-02T20:31:47.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2022-03-31T03:34:19.000Z"
    },
    "comments": [
        {
            "created_at": "2022-03-31T03:34:19.748Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-15281?focusedCommentId=17515046) by Weston Pace (westonpace):*\nIssue resolved by pull request 12560\n<https://github.com/apache/arrow/pull/12560>"
        }
    ]
}