{
    "issue": {
        "title": "[Website] Mention Ursa Labs Zulip and ASF Slack on Community page",
        "body": "***Note**: This issue was originally created as [ARROW-16830](https://issues.apache.org/jira/browse/ARROW-16830). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThe Arrow developer community uses the Ursa Labs Zulip instance and some Arrow-related channels in the ASF Slack instance for synchronous communication. We should document this on the of [Community page](https://arrow.apache.org/community/) of the Arrow website.\r\n\r\nSome considerations:\r\n \\* Can we provide public links that people can use to join both Zulip and Slack? (From what I understand, yes for both.)\r\n \\* The ASF Slack has very low message volume. Is there any harm done by directing people toward a very quiet Slack channel? (IMO it is probably not a problem as long as we set expectations appropriately.)\r\n \\* By making these channels more accessible, will we increase misuse of these channels? For example will people start reporting issues here instead of through the appropriate channels? (IMO it will probably not create a significant problem as long as we communicate what the appropriate use of these channels is.) \r\n \\* How committed are we in the long term to use of these Zulip and Slack instances? (This is unclear to me, but even if we are not committed and might soon abandon these and move to different synchronous communication channels, this ticket and the associated PR should help to motivate more conversation about this.)",
        "created_at": "2022-06-14T09:49:40.000Z",
        "updated_at": "2022-09-12T16:50:19.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Website",
            "Type: enhancement"
        ],
        "closed": false
    },
    "comments": [
        {
            "created_at": "2022-09-12T16:50:19.680Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-16830?focusedCommentId=17603189) by @toddfarmer:*\nThis issue was last updated over 90 days ago, which may be an indication it is no longer being actively worked. To better reflect the current state, the issue is being unassigned per [project policy](https://arrow.apache.org/docs/dev/developers/bug_reports.html#issue-assignment). Please feel free to re-take assignment of the issue if it is being actively worked, or if you plan to start that work soon."
        }
    ]
}