{
    "issue": {
        "title": "[Plasma][C++] Usage model for Object IDs. Object IDs don't disappear after delete",
        "body": "***Note**: This issue was originally created as [ARROW-8873](https://issues.apache.org/jira/browse/ARROW-8873). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nI have an environment that uses Arrow + Plasma to send requests between Python clients and a C++ server that responds with search results etc.\r\n\r\nI use a sequence number based approach for Object ID creation so its understood on both sides. All that works well. So each request from the client creates a unique Object ID, creates and seals it etc. On the other end, a get against that Object ID retrieves the request payload, releases and deletes the Object ID. A similar response scheme for Object IDs are used from the server side to the client to get search results etc where it creates its own unique Object ID understood by the client. The server side creates and seals and the Python client side does a get and deletes the Object ID (there is no release method in Python it appears). I have experimented with deleting the plasma buffer.\r\n\r\nThe end result is that as transactions build up, the server side memory use goes way up and I can see that a good # of the objects aren't deleted from the Plasma store until the server exits. I have nulled out the search result part too so that is not what is accumulating. I have not done a memory profile but wanted to get some feedback on some what might be wrong here.\r\n\r\nIs there a better way to use Object IDs for example? And what might be causing the huge memory usage. In this example, I had ~4M transactions between clients and the server which hit a memory usage of about 10+ GB which is in the ballpark of the size of all the payloads. Besides doing release-deletes on Object IDs, is there a better way to purge and remove these objects?\r\n\r\nAny help is appreciated.",
        "created_at": "2020-05-20T16:05:55.000Z",
        "updated_at": "2022-10-12T15:35:36.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Component: C++ - Plasma",
            "Component: Python",
            "Type: test"
        ],
        "closed": false
    },
    "comments": []
}