{
    "issue": {
        "title": "[Format/C++/Java] Removing field layout from Schema.fbs breaks backward compatibility",
        "body": "***Note**: This issue was originally created as [ARROW-2843](https://issues.apache.org/jira/browse/ARROW-2843). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nChange in [ARROW-1785](https://issues.apache.org/jira/browse/ARROW-1785)\r\n\r\nBreaks backward compatibility with schema generated in prior versions of Arrow, as VectorLayout field was removed from Field table.\r\n\r\nThis is definitely not supported behavior in FlatBuffers.\r\n\r\nI suggest to put back following field\r\n```java\n\r\nlayout: [ VectorLayout ] (deprecated);\r\n```\r\n into \r\n```java\n\r\ntable Field \r\n```\r\nand mark it \"deprecated\" - as shown above\r\n\r\nIt will also require putting back \r\n```java\n\r\ntable VectorLayout\r\n```\r\nwhich can have all the deprecated fields as well.\r\n\r\ncode generation footprint will be minimal in this case, as FlatBuffers won't generate getters for deprecated fields, but it will really solve backward compatibility issues.\r\n\r\nAlso may be a good idea to introduce \"version\" into Schema.\r\n\r\n \r\n\r\n \r\n\r\n ",
        "created_at": "2018-07-12T22:57:36.000Z",
        "updated_at": "2018-07-27T04:28:25.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Format",
            "Type: bug"
        ],
        "closed": true,
        "closed_at": "2018-07-20T01:39:29.000Z"
    },
    "comments": [
        {
            "created_at": "2018-07-12T23:17:31.750Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2843?focusedCommentId=16542323) by Wes McKinney (wesm):*\nI'm -0 to -1 on this change. We do already have a metadata version number. \r\n\r\nWe've made no guarantees of backwards compatibility in the columnar format metadata yet, so we have broken no contracts with users.\r\n\r\nTo be honest, I'm not pleased that there are still a number of underspecified parts of the columnar format and metadata. As an example, I proposed a more complete Interval / Timedelta type about a year ago and these changes have still not been implemented. \r\n\r\nI would very much appreciate if Dremio and other parties depending on Arrow in production would work more proactively with me and others in the Arrow community to reach a point where we can declare a stable 1.0 version of the columnar format and its metadata. In particular, if any more breaking changes are required (I hope that there will not be), that we make them as soon as possible to minimize disruption to applications."
        },
        {
            "created_at": "2018-07-13T00:54:53.455Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2843?focusedCommentId=16542383) by Yuliya Feldman (yufeldman):*\nThank you `[~wesmckinn]`  for very quick reply and thoughts.\r\n\r\nI do understand about \"no guarantees\" part, but why not do our best to maintain backwards compatibility, especially when it is possible.\r\n\r\n \r\n\r\n "
        },
        {
            "created_at": "2018-07-13T04:16:24.312Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2843?focusedCommentId=16542495) by Wes McKinney (wesm):*\nIn my opinion, we haven't worked hard enough as a community to stabilize the metadata. We have failed to make progress since mid-2017, why is that? I have been trying consistently to advance to a 1.0 release; can we not work together to finalize the binary protocol? "
        },
        {
            "created_at": "2018-07-13T21:28:40.578Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2843?focusedCommentId=16543740) by Yuliya Feldman (yufeldman):*\nI truly appreciate your opinion on general direction and collaboration. I just don't feel it should be part of this JIRA.\r\n\r\nMy main concern is backward compatibility when we can do it. "
        },
        {
            "created_at": "2018-07-20T01:39:16.853Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2843?focusedCommentId=16550093) by Yuliya Feldman (yufeldman):*\nI am going to resolve this Jira as \"won't fix\", as it will create issues with 0.8, 0.9 versions around backward compatibility (though we did not promise it yet).\r\n\r\nJust for the future we have to be much more strict regarding changes in \"fbs\" and do not allow fields removal - make them deprecated at least."
        }
    ]
}