{
    "issue": {
        "title": "[Java][Docs] Document environment variables/java properties",
        "body": "***Note**: This issue was originally created as [ARROW-6206](https://issues.apache.org/jira/browse/ARROW-6206). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nSpecifically, \"-Dio.netty.tryReflectionSetAccessible=true\" for JVMs >= 9 and BoundsChecking/NullChecking for get.\r\n\r\n \r\n\r\n ",
        "created_at": "2019-08-12T02:44:22.000Z",
        "updated_at": "2019-08-21T14:20:35.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Documentation",
            "Component: Java",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2019-08-14T06:16:26.000Z"
    },
    "comments": [
        {
            "created_at": "2019-08-12T02:51:17.092Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16904808) by Ji Liu (tianchen92):*\nCurious where to update docs? is /arrow/java/README.md?\r\n\r\nI just noticed that something in this file should also be updated like 'Java Code Style Guide'"
        },
        {
            "created_at": "2019-08-12T03:16:20.477Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16904816) by Micah Kornfield (emkornfield@gmail.com):*\narrow/java/README.md is what I was thinking. At some point we might want to create more formal docs using restructured text at: <https://github.com/apache/arrow/tree/master/docs/source>"
        },
        {
            "created_at": "2019-08-12T03:25:14.023Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16904819) by Ji Liu (tianchen92):*\nYes, I think Wes has created a issue for restructured text https://issues.apache.org/jira/browse/ARROW-5542.\r\n\r\nOne more question, why should set jvm param for JVM>=9?\r\n\r\nNot quite familiar, seems \r\n\r\n<io.netty.tryReflectionSetAccessible>true</io.netty.tryReflectionSetAccessible> is already in pom.xml, it dosen't work?\r\n\r\n "
        },
        {
            "created_at": "2019-08-12T03:54:26.950Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16904828) by Micah Kornfield (emkornfield@gmail.com):*\nIt could probably be set, for all versions, but I think it is only required past JVM 8 (could be mistaken though).\r\n\r\n \r\n\r\n\"<io.netty.tryReflectionSetAccessible>true</io.netty.tryReflectionSetAccessible> is already in pom.xml, it dosen't work?\"\r\n\r\nThe only reference I found was for test execution in POM.xml. I think Consumers of the library have to set this property themselves when running the JVM.  But my maven knowledge is weak, so I might be misunderstanding something."
        },
        {
            "created_at": "2019-08-12T04:10:30.710Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16904831) by Ji Liu (tianchen92):*\nSeems you are right, the reference was in test execution.\r\n\r\nIf you would like to provide a PR for this, I think ''Java Code Style Guide' could also be updated (unused imports, redundant modifier) or I can take this issue:) (If so please let me know if there's other info should be updated besides the above ones)."
        },
        {
            "created_at": "2019-08-12T04:21:00.088Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16904832) by Micah Kornfield (emkornfield@gmail.com):*\nI would say we don't need to include \"stricter\" things in the README, since\nthey aren't really exceptions.\n\n\n"
        },
        {
            "created_at": "2019-08-12T04:24:26.213Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16904834) by Ji Liu (tianchen92):*\nFine, no problem."
        },
        {
            "created_at": "2019-08-13T10:01:55.288Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16906033) by Jim Northrup (jimn235):*\nNIO is not going to go away, and java is not going to stop harboring unreproducable NIO bugs.\r\n\r\nis there a charter for what java usecases will be supported, and THEN, what among these items will leverage NIO, and what among these can use pure heap implementations of objects exclusively?\r\n\r\nthe utilities should abandon all hope of stability or useful benchmarks while there is a NIO component in a  piece of code.  the oracle engineers this year are certainly not on the same page as the jdk8 team, or the jdk6 team.  \r\n\r\nUnsafe/NIO usecases number about 2:\r\n\r\nif you're utilizing mmap files to minimize page faults, go there.\r\nif you're talking to crossplatform structs and mailboxes, you have no choice.\r\nif you're squirreling away heap objects using something greater than the -Xmx setting, you should probably engineer it through mmap file access instead of using native handles directly, this is extremely unstable in my experience.\r\n \r\n"
        },
        {
            "created_at": "2019-08-13T16:02:36.927Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16906345) by Micah Kornfield (emkornfield@gmail.com):*\n\"is there a charter for what java usecases will be supported, and THEN, what among these items will leverage NIO, and what among these can use pure heap implementations of objects exclusively?\"\r\n\r\nI don't fully understand this question.  My best attempt to answer it below:\r\n\r\nThe system property is needed because we use Netty as an off-heap memory allocator, this could potentially be replaced with something JNI based.\r\n\r\nThe core of the current Java implementation is off-heap memory.  If you have specific requirements/use-cases in mind discussing dev@ or user@ mailing list is probably the way to go.\r\n\r\n \r\n\r\nCould you provide a link to the text you quoted I'd be interested in reading it.\r\n\r\n \r\n\r\n "
        },
        {
            "created_at": "2019-08-13T16:04:47.147Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16906350) by Micah Kornfield (emkornfield@gmail.com):*\n`[~tianchen92]` thanks for volunteering to do this."
        },
        {
            "created_at": "2019-08-14T06:16:26.299Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16906922) by Micah Kornfield (emkornfield@gmail.com):*\nIssue resolved by pull request 5078\n<https://github.com/apache/arrow/pull/5078>"
        },
        {
            "created_at": "2019-08-20T15:33:58.503Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16911465) by Jim Northrup (jimn235):*\n> Could you provide a link to the text you quoted I'd be interested in reading it.\r\n \r\nthis is the benefit of having written what amounts to a netty analog over the course of 4 years, including an SSL/TLS sockets layer for http at one point.  ultimately there is danger in long-lived services using NIO, end-of-story.\r\n\r\nthe process cleanup of the underlying OS will be the best protection against java NIO/JNI memory handles – if you have a daemon or long-running thing, or you must use directbuffers, assume that the reference counting is imperfect, and it will bite you one day (it may take days) if you trust it.  so thing that use nio should be short lived, and wherever possible process encapsulated.  \r\n\r\nnetty is the jboss-endorsed c10k java representative with the popular marketshare. iiuc arrow is a team that picked up netty derived off-heap tools naively and demonstrated that in 2019 it's still prone to some gotchas that are a little bit stronger than edge cases when the unit tests pass.  indeed, my initial testing with writing jdbc to arrow on kilobytes of records succeeded well, and gave me the confidence to assume this will do the job faster than python.  and so began this thread on 800+ megabytes of data.\r\n\r\nconsidering the age and size of the netty ecosystem, there is no lack of scrutiny or open source virtue here.  it's a VM-level weakness that java NIO is still something like peanuts in the kitchen, you should really put a consumer facing notice on where NIO is and is not present.\r\n\r\n\r\n\r\n"
        },
        {
            "created_at": "2019-08-21T03:45:33.293Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16911922) by Micah Kornfield (emkornfield@gmail.com):*\n\"iiuc arrow is a team that picked up netty derived off-heap tools naively and demonstrated that in 2019 it's still prone to some gotchas that are a little bit stronger than edge cases when the unit tests pass.\"\r\n\r\nIt is true the Java Arrow library has a steep learning curve, and could use better documentation so new developers aren't bitten.  There has also been less focus on the non-core Java libraries (i.e. adapters) until recently, and we need to do something distinguish the maturity between them so these types of things are less surprising.  If you have suggestions please let us know.  I would suggest perhaps sending mail to the dev@ or user@ mailing lists, since generally more people monitor those then conversations on JIRA.  FWIW, the core library was adapted from Apache Drill and used by Dremio in their product, both of which, iiuc are long running processes that provide competitive analytic performance (I don't know how prone to resource leakage they are are).\r\n\r\n \r\n\r\n\"and gave me the confidence to assume this will do the job faster than python. and so began this thread on 800+ megabytes of data.\"\r\n\r\nI'm sorry you ran into this.  If think you are working into the python ecosystem Turbodbc might be your best bet of getting data into Arrow.  In general, most of the python code is just a facade on top of C++ so I would expect it to be pretty performant.  Please discuss on the mailing list or continue to file JIRAs if you are seeing unexpected performance/behavior.  We want to know.\r\n\r\n \r\n\r\n\"you should really put a consumer facing notice on where NIO is and is not present.\"\r\n\r\nWould you mind opening up a JIRA/Pull Request describing how you think it is best to publicize it?\r\n\r\n \r\n\r\n "
        },
        {
            "created_at": "2019-08-21T05:30:26.542Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16911955) by Jim Northrup (jimn235):*\n(previsouly responded as email, sorry if this creates a dupe)\r\n\r\n \r\n\r\nI admire Arrow for doing a thing well.  I hope that if I simply call “mvn maven-versions-plugin:latest” in the future this simple jdbc code will work better than before.\r\n\r\n \r\n\r\nI appreciate the attention to the details.\r\n\r\n \r\n\r\nI think through this discussion the jist is that tensorflow one-hot columns may quickly test the expected norms of arrow.  Likewise, timeseries datasets have us blowing gaskets all over the place in terms of time-to-completion and RAM using pandas.  What do we do with a 300 gig numpy dataset living in swap that takes 3 dasy to build? There’s no LSTM examples to demonstrate anything but toy datasets.\r\n\r\n \r\n\r\nTurbodbc looks like a good fit for reducing transcription times.\r\n\r\n \r\n\r\nFor what I need in the space of Arrow, I think the ideal tool is something to work in and out of numpy and delegate to and from apache Geode or Hazelcast as the main substrate. \r\n\r\n \r\n\r\nIf perchance arrow can act as a window to memory grids, all the better.\r\n\r\n \r\n\r\nAs I find the time for signups and 2fa’s I will compose this to the lists\r\n\r\n "
        },
        {
            "created_at": "2019-08-21T14:20:35.560Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-6206?focusedCommentId=16912326) by Wes McKinney (wesm):*\n> As I find the time for signups and 2fa’s I will compose this to the lists\r\n\r\nThis shouldn't be too complicated, all you have to do is send an e-mail to dev-subscribe@arrow.apache.org"
        }
    ]
}