{
    "issue": {
        "title": "[Rust] [DataFusion] Decide on CAST behaviour for invalid inputs",
        "body": "***Note**: This issue was originally created as [ARROW-10793](https://issues.apache.org/jira/browse/ARROW-10793). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\nThis is a placeholder for now. See discussion on <https://github.com/apache/arrow/pull/8794>\r\n\r\nBriefly, the issue is do we want CAST to return null for invalid inputs or throw an error. Spark has different behavior depending on whether ANSI mode is enabled or not.\r\n\r\nI'm not sure if this is a DataFusion specific or a more general Arrow issue yet. It needs a discussion.\r\n\r\n \r\n\r\n ",
        "created_at": "2020-12-02T21:59:29.000Z",
        "updated_at": "2021-04-26T13:23:23.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: Rust - DataFusion",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2021-04-26T13:23:23.000Z"
    },
    "comments": [
        {
            "created_at": "2020-12-02T22:44:31.207Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10793?focusedCommentId=17242793) by Mike Seddon (MikeSeddonAU):*\nI strongly feel that DataFusion should adopt the ANSI-style strict typing rather than silent error suppression and return of NULL values as intuitively (due to years of using DBMS) users expect that if an error was not thrown then all operations were completed successfully.\r\n\r\nThe default Spark behavior was inherited from Hive SQL which I assume was originally built to support a business where absolute precision was not necessarily important. As part of the Spark 3.0 release a huge amount of effort was put in to comply with ANSI standard SQL ([https://spark.apache.org/docs/3.0.0/sql-ref-ansi-compliance.html](https://spark.apache.org/docs/3.0.0/sql-ref-ansi-compliance.html))) which is obviously a lot harder to retrofit than start with.\r\n\r\nThis also goes wider than type conversions as adopting ANSI SQL standards (including functionality like <https://github.com/apache/arrow/pull/8688> which I think requires a CASE statement in ANSI SQL) should maybe be agreed by the PMC to give a framework for assessing PRs against. Perhaps this ticket should be changed to a discussion of which dialect of SQL DataFusion aims to support."
        },
        {
            "created_at": "2021-04-26T13:23:22.787Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-10793?focusedCommentId=17332314) by Andrew Lamb (alamb):*\nMigrated to github: https://github.com/apache/arrow-datafusion/issues/120"
        }
    ]
}