{
    "issue": {
        "title": "[C++] Extend DictionaryBuilder to support delta dictionaries",
        "body": "***Note**: This issue was originally created as [ARROW-2176](https://issues.apache.org/jira/browse/ARROW-2176). Please see the [migration documentation](https://gist.github.com/toddfarmer/12aa88361532d21902818a6044fda4c3) for further details.*\n\n### Original Issue Description:\n[The IPC format](https://arrow.apache.org/docs/ipc.html) specifies a possibility of sending additional dictionary batches with a previously seen id and a isDelta flag to extend the existing dictionaries with new entries. Right now, the DictioniaryBuilder (as well as IPC writer and reader) do not support generation of delta dictionaries.\r\n\r\nThis pull request contains a basic implementation of the DictionaryBuilder with delta dictionaries support. The use API can be seen in the dictionary tests (i.e. [here](https://github.com/alendit/arrow/blob/delta_dictionary_builder/cpp/src/arrow/array-test.cc#L1773)). The basic idea is that the user just reuses the builder object after calling Finish(Array\\*) for the first time. Subsequent calls to Append will create new entries only for the unseen element and reuse id from previous dictionaries for the seen ones.\r\n\r\nSome considerations:\r\n1. The API is pretty implicit, and additional flag for Finish, which explicitly indicates a desire to use the builder for delta dictionary generation might be expedient from the error avoidance point of view.\n1. Right now the implementation uses an additional \"overflow dictionary\" to store the seen items. This adds a copy on each Finish call and an additional lookup at each GetItem or Append call. I assume, we might get away with returning Array slices at Finish, which would remove the need for an additional overflow dictionary. If the gist of the PR is approved, I can look into further optimizations.\n   \n   The Writer and Reader extensions would be pretty simple, since the DictionaryBuilder API remains basically the same. ",
        "created_at": "2018-02-19T16:18:21.000Z",
        "updated_at": "2018-03-02T14:37:38.000Z",
        "labels": [
            "Migrated from Jira",
            "Component: C++",
            "Type: enhancement"
        ],
        "closed": true,
        "closed_at": "2018-03-02T14:29:31.000Z"
    },
    "comments": [
        {
            "created_at": "2018-03-02T14:29:31.167Z",
            "body": "***Note**: [Comment](https://issues.apache.org/jira/browse/ARROW-2176?focusedCommentId=16383633) by Uwe Korn (uwe):*\nIssue resolved by pull request 1629\n<https://github.com/apache/arrow/pull/1629>"
        }
    ]
}